INSERT INTO blogpost VALUES ('a0da8717-ce71-41c5-b652-858ec758b973', 'What''s good enough for you is good enough for me. It''s good enough.', '久しぶりにグーニーズを観たいなあ。連休にビデオ借りるか。
', '2007-04-28 10:19:20+00', '2007-04-28 10:19:20+00');
INSERT INTO blogpost VALUES ('34fde625-61eb-4bce-8e05-a0226e4fce94', '英文コメント拒否機能', '英文コメント拒否機能を追加いたしました

SPAM避けなのは分かる。分かるんだけど。

ブログ全体に適用するか、まったく適用しないかの2択……
', '2006-04-03 04:22:41+00', '2006-04-03 04:22:41+00');
INSERT INTO blogpost VALUES ('a534ff12-70c4-4896-91c8-584f7ad6728b', '俺、再び参上！', 'キバの第1話を観たところだったんだが、

電王の続編だと～～～！！！１１１
', '2008-01-26 23:31:10+00', '2008-01-26 23:31:10+00');
INSERT INTO blogpost VALUES ('73f62763-4425-415c-9cd1-93b5b992eb6e', '五年生', 'アフタヌーンに連載中「五年生」。

この漫画にリアリティを感じれる年齢なんだなあ。いつのまにか。', '1999-11-26 14:59:59+00', '1999-11-26 14:59:59+00');
INSERT INTO blogpost VALUES ('60c5e337-559d-4b9f-90fd-02b3bc359bf5', 'アクセステクノロジー', 'という人材紹介会社からやたらと職場に電話がかかってくる。

うっとうしいことこの上ないので、「猪股はこの部署にいない」と言って切ってやった。

あ、ちなみにこの会社の人たち、英語で電話をかけてきやがりますが、英語が分からないフリを続けていると日本語で話してくれます。きっと英語能力を測っているのだろうけど、興味がない人は英語に付き合う必要ないです。', '2007-08-28 09:48:22+00', '2007-08-28 09:48:22+00');
INSERT INTO blogpost VALUES ('62b7f85e-17df-4c5c-a42d-f4a72e293587', 'いきなり次回予告！', 'いきなり次回予告！

「――私、ピン子をずっと…見てたから。」

壽賀子がピン子に告白をしている中、えなりはひたすら明日発売の雑誌を雨の中探していた……。

このままピン子は壽賀子のモノになってしまうのか…！！

そしてえなりは発売してるハズのない雑誌を探してていいのか？？

次回、「雨に濡れて。～気付けば二日酔い～（仮）」

えなり「…もう一軒オーケイですか、神様？」', '2001-02-12 14:59:59+00', '2001-02-12 14:59:59+00');
INSERT INTO blogpost VALUES ('5527a5d5-acd6-4bc0-8435-272ad5b2d13e', 'Java論争(joke)', 'こうですか！？わかりません！', '2008-05-06 03:26:11+00', '2008-05-06 03:26:11+00');
INSERT INTO blogpost VALUES ('9da45e75-57a8-4be7-bc4f-4e5f412a05c4', 'C#: 昨日、今日、明日: アンダース ヘルスバーグへのインタビュー Part 2', '移動しました', '2006-01-18 17:07:58+00', '2006-01-18 17:07:58+00');
INSERT INTO blogpost VALUES ('4683ed9e-8828-444e-b336-734a85a6c284', '世の中には不思議なことなど何もない', 'テレビをつけたまま京極堂を読んでたら、「もうりょう」という言葉がテレビから聞こえてきてドキっとした。

テレビに目をやると、そこには薄毛の人の頭が。

「毛量」だった。', '2010-01-17 20:14:41+00', '2010-01-17 20:14:41+00');
INSERT INTO blogpost VALUES ('da8fc8e1-f8bc-444f-af6f-edea6d805eae', '正月から', '神様からお年玉を頂きました。ケツァルコアトル神さま、ありがとう。

…大丈夫。変な宗教にはまった訳じゃございません。ケツァルコアトルは、アステカ文明の神です。', '2000-01-02 14:59:59+00', '2000-01-02 14:59:59+00');
INSERT INTO blogpost VALUES ('21290b12-2c61-4e32-814e-6d2cfc208f52', '1998/6/30の日記', 'これだけは言っておきたい。the brilliant greenってそんなに良いか？', '1998-06-30 14:59:59+00', '1998-06-30 14:59:59+00');
INSERT INTO blogpost VALUES ('6f58c66d-5c1d-4597-88b1-0ee16ce77cd2', '1998/10/5の日記', '昨日三浦と一緒にまつしま家に行った。「アンダルシアの犬」という超シュールなサイレント映画を観た。訳わかりません。いつの時代にもとち狂った芸術家はいるもんだ。 ', '1998-10-05 14:59:59+00', '1998-10-05 14:59:59+00');
INSERT INTO blogpost VALUES ('492e9f06-5782-4d86-986d-21511cf7e0b2', '2015 明けましておめでとうございます', '2015年元日。明けましておめでとうございます。

昨年の目標「やせる」はぜんぜん達成されていません。今年はスポーツジムに通うなどして強制的に体を動かすようにしたいな。', '2015-01-01 09:03:54+00', '2015-01-01 09:03:54+00');
INSERT INTO blogpost VALUES ('2d20f14a-1df5-4f74-921f-2ed6325670f7', '1998/8/24の日記', '最近の発見。バイト先の寿司屋には「はらたいら」のキープボトルがある(実話)。一回来ただけみたいだけど。 

お笑い共通一次の問題をWebでゲット。早速やってみよう。 

今さらながら「パラサイト・イヴ」「犬神家の一族」を読む。地下鉄の駅文庫って内容が流動的なので、こんな変なタイミングになってしまう。', '1998-08-24 14:59:59+00', '1998-08-24 14:59:59+00');
INSERT INTO blogpost VALUES ('7782e74e-3c0c-4739-b71b-2d38fc8031a4', 'SQL Server Web 管理ツール (マイクロソフト)', '河端善博さんのブログ経由

マイクロソフトがSQL Server Web Data Administratorを公開した。

phpMyAdminのSQL Server版、みたいな感じか。

とりあえず、ASP.Net Enterprise Managerとはまた違うようだ。

ライセンス形態がどうなっているか、機能面での特徴は、などを調べてみたい。

SQL ServerのEnterprise Managerを使える人にとっては不要なのかもしれないが、レンタルWebスペースなどでSQL Serverを触っている人にとっては重宝するツールだろう。

(2004.11.15追記)

「コンピュータ系blog」のエントリが参考になる。

そうか、DbaMgrか。なかなかいいな。
', '2004-02-23 04:14:00+00', '2004-02-23 04:14:00+00');
INSERT INTO blogpost VALUES ('f22cc5ff-450f-4846-b8b7-d969ed3116f4', 'Dynamic Languages SDK 0.3.0', 'Dynamic Languages SDK 0.3.0

Tech Edも終わり、LL Futureに行ってる間に出てたみたいだ。全部乗せアーカイブも提供される。名前募集中だってさ(Silverlight Dynamic Languages SDKも、sdlsdkも、どっちもひどいから)', '2008-09-01 10:26:46+00', '2008-09-01 10:26:46+00');
INSERT INTO blogpost VALUES ('ba5334c1-665a-4800-9fca-c99a40452ded', 'TypeKeyとSingle Sign On', 'Movable Typeの開発元でTypePadというBlogサービスをやっているSix Apart社が認証&プロファイル管理サーバを立ち上げるという話。（NDO::Weblog「TypeKey Overview」を参照のこと)

オンラインビジネス向け認証サービスといえば…の、.NET Passportは、あまり盛り上がっていない様子。

(CNET Japan「マイクロソフトのPassportはどこへいく?」を参照のこと)

この違いは何なんだろう。公開を前提としている情報で機密性が低いから、サービスの信頼性が問題にならない？うーむ、利便性と信頼性とのトレードオフの話で終わってしまってはつまらない。もう少し考えてみたい。

そうだ、Liberty Allianceはどうなっている？

私が興味を持ったのは、インテルの加盟、それから日本での事例としてNTTコミュニケーションズのCoDenに順次適用というニュース、総務省のe-LearningシステムEduMartの実証実験(リンク先はpdf)、こんなところかな。', '2004-03-26 04:05:32+00', '2004-03-26 04:05:32+00');
INSERT INTO blogpost VALUES ('8e30f884-a5de-4e6a-87f3-7d060dd33649', '.NETのWindows FormsコントロールをIE上でホストする場合の覚書', 'HOW TO: Use the IEHost Log to Debug .NET Object Hosting in Internet Explorer

How to use the AllowPartiallyTrustedCallers attribute to call an assembly that has a strong name from a Web page by using Visual C# .NET

安全なActiveXコントロールとして使えるか。

(追記)構成ファイルについてもメモ。

Internet Explorer を使用したランタイム アプリケーションの配置', '2005-02-23 12:01:56+00', '2005-02-23 12:01:56+00');
INSERT INTO blogpost VALUES ('32573b3d-2fa2-4fad-9a17-a4199689175e', 'そろそろTable Moduleについてひとこと言っておくか (overflow)', 'Table Moduleを語るにはDomain Modelのことも語らざるを得ないわけで、そんな頃にドメイン駆動が出たから買って読んでおり、まあ無駄に長い本で読むのに苦労し、くやしいからドメイン駆動の感想みたいなのもブログのネタにしようと準備していて、そしたらTable Moduleの方はすっかり手が止まってしまっている訳で。

先にドメイン駆動の方を片付けてしまう予定。', '2008-04-28 18:45:05+00', '2008-04-28 18:45:05+00');
INSERT INTO blogpost VALUES ('7d584afb-21a7-463c-a599-7565b6136725', 'フリーセル(その2)', 'フリーセルの続き。

アルゴリズムはほとんど変えず、内部構造だけ変えたら、とたんに3秒で答えを出すようになった。

答えあわせはまだだけど、100倍近く速くなったのでびびった。

ちなみに深さ優先探索で、発見された解の手数は6000ステップ強。これを幅優先探索に変えたらどうなるんだろうか。楽しみ。', '2007-07-12 11:48:44+00', '2007-07-12 11:48:44+00');
INSERT INTO blogpost VALUES ('3c09e74f-4382-4385-ab2d-40170c2d8bc2', '魍魎の匣', '観てきた。面白かった。

ただ、脚本は期待したものとちょっと違ったなあ。

二時間にみっしり収めるためにアレンジせざるをえなかったのは解るが、それでも不満はある。

ネタバレになるから多くは書かないが、ひとつだけ。榎木津が出過ぎ！もっと木場で魅せろ！

', '2008-01-05 15:14:49+00', '2008-01-05 15:14:49+00');
INSERT INTO blogpost VALUES ('8fe35017-650d-486d-9d6f-b24a8cc91b2a', '1998/3/30の日記', '想像するだけで嫌なもの。田中康夫と秋元康の対談。 ', '1998-03-30 14:59:59+00', '1998-03-30 14:59:59+00');
INSERT INTO blogpost VALUES ('d6c37a27-ad84-4ed7-ab0f-5b95462ae315', 'X Internet', '@ITにスマートクライアント関連の記事を書きました。「スマート・クライアントの傾向と対策」です。

その記事が掲載される少し前に掲載された、安藤さんによる連載コラム「安藤幸央のランダウン」は、「リッチクライアント時代の到来」という見出しでした。

その記事で紹介されていたNexawebを見て、X Internetを思い出しました。

X Internetはアメリカの調査会社であるForrester社が言い出したキーワードで、これからのインターネットは「eXecutable」を経て「eXtended」にたどり着くという考えを表すものです。詳細は、"My View: X Internet"や、"The X Internet"をお読みください。

Forresterは「eXecutable Internet」の例として、CurlやNexawebを始め、Droplets、Altio、Luxor XUL、XWT、Zapletといったリッチクライアント技術を紹介していました。

2002年ごろにいくつかの製品についてデモを試してみたことがあります。Java AppletやActiveXコンポーネントを使った、最近だとリッチ・インターネット・アプリケーションと言われるようなモノが多かったと記憶しています。

"X Internet: Rich Client Development - A collection of links, opinions, etc."というページにもリンク集がありますから、興味がわいた人は辿ってみてください。', '2004-05-18 11:33:35+00', '2004-05-18 11:33:35+00');
INSERT INTO blogpost VALUES ('0c516c40-d37b-4ec5-8945-2736ccce963b', '夏野菜カレー', '玉ねぎ、人参、苦瓜、ズッキーニ、南瓜、セロリ、エリンギ、鶏胸肉。

今日はトマトはなし。
', '2007-08-05 09:10:24+00', '2007-08-05 09:10:24+00');
INSERT INTO blogpost VALUES ('f2dc004a-983a-499a-b7d8-4bcb66a55c2f', '「ノートルダムのせむし」に出てくるのは前者', 'エスメラルダはスペイン語。エメラルダスは造語。

よく混同するんですが、松本零士のせいにしてもいいですか。 ', '2002-01-31 14:59:59+00', '2002-01-31 14:59:59+00');
INSERT INTO blogpost VALUES ('7dd6f675-79f5-4055-a366-8262a839e049', '今夜わかるVBファミリー アップロードした', 'JavaとC#ならわかるという人向けに、カジュアルにVB6/VBA/VBScriptを説明する資料を作っている。でも俺もぜんぜん詳しくないんだけどな。

download pdf file', '2008-10-01 08:57:42+00', '2008-10-01 08:57:42+00');
INSERT INTO blogpost VALUES ('63d4aa1b-840c-4605-96a9-d7421b81e1ec', '靖国神社参拝', '中国韓国朝鮮がどうこうというのはこの記事では扱わない、興味ないから。

この記事で述べる「政治的に正しい／正しくない」は、英語でいうPolitical Correctness、つまり、社会的な公平さがあるかないかだけの意味である。内政だとか外交だとかいう実際の政治を意識したものではない。

靖国神社は墓ではない。戦死者の「魂を祀る」という特定宗教のための施設だから、首相が首相として参拝するのは「政治的に正しくない」。千鳥ヶ淵の戦没者墓苑は墓だ。特定宗教色は薄れるから、「政治的に正しい」。

寺や神社は日本の文化と密接に関連している。そのせいか寺や神社が宗教施設だという意識が弱い人はたくさんいるけど、日本人全員がそう信じているわけではない。また、人数の多寡によって、寺や神社が宗教施設ではなくなるわけではない。

神社というか神道が日本ローカルの宗教で、他国には馴染みがないのも話をややこしくする。「死んだら善人も悪人もなくなって清浄な魂となる」「死者の魂を祀らないと生者に害をなすことがある」みたいな宗教概念が理解されないと、なんでA級戦犯を祀ったりするのか意味が分からないだろう（悪事を許して受け入れているのか、あるいは悪事も込みで崇拝しているのかと誤解される）。神道における魂とはあきらかに宗教概念のひとつなのだけど、神道を宗教だと思っていない人は、それはただの歴史ある日本文化でしかないとでも思っているのだろうか？

それから、靖国神社がただの神社の一つというのは全く通らない。戦前の国家神道を引き継ぐ「いわくつき」の神社だ。もちろん国の管理からは離れているが（当然だ）、靖国神社は神社本庁とは独立した宗教法人であり特別な存在だ。本当に「戦死者を祀るただの神社」が欲しいのなら新しくそのような神社を神社本庁が建てればいいのだけど、そうしない。本庁も靖国を特別視している。

というわけで首相が靖国参拝することには否応なしに特別な意味が生まれる。そういう行為が「政治的に正しくない」のは明らかだろう。', '2013-12-27 01:06:35+00', '2013-12-27 01:06:35+00');
INSERT INTO blogpost VALUES ('24ead78f-c7eb-4b11-a173-81174862ce9b', '英語教師の悲劇', 'アイ ハー ジュー オン ダ ワイ レス バッ キン フィフ ティッ トゥー

ライ イン ガ ウェイ キン テン タッ チュー ニン ギノン ニュー

イ ファイ ウォ ジャン ギッ ディドゥンストッ ユー カーミン ツルー

アーワ アーワ

デイ トゥク ダッ クレ ディッ フォー ヤー セッ カン シン フォ ニー

リウ リー トゥン バイ マッ シー ナン ニュー テッ ノロ ジー

アン ナ ワイ アン ダス タン ダッ プロッ ブレン ジュー カン スィー

アーワ アーワ

アイ メッ ダッ チゥ ズレン

アーワ アーワ

ワッ ディッ ジュー テゥ デム

ヴィ ディ オウ キゥ ダ レイ ディ オウス ター

ヴィ ディ オウ キゥ ダ レイ ディ オウス ター

ピッ チャーズ ケーイ マーンブ　ロウ キョー ハーッ

オーア オッオー オッオー

えーと、仕事してないときはこういうことばっかり考えています。', '2007-08-08 13:06:39+00', '2007-08-08 13:06:39+00');
INSERT INTO blogpost VALUES ('655d3255-71a3-49ff-ad1f-b41635112c21', 'Expression Webは Office 2007 ファミリーです', 'はてなダイアリーへ移動しました', '2008-12-11 04:48:58+00', '2008-12-11 04:48:58+00');
INSERT INTO blogpost VALUES ('0fde039f-2e28-4fd3-be72-bf818a66df45', 'MicroSoft MVP artonで検索した人へ', 'ここを見るといいですよ、ってこのblogを見に来ることはもうないだろうけど。', '2008-07-30 05:40:31+00', '2008-07-30 05:40:31+00');
INSERT INTO blogpost VALUES ('bb14e1d5-f777-49c1-8cb2-a0daa32ea26c', 'System.Data.SQLite', 'SQLiteエンジンの.NET Framework実装(だと思う)

http://sqlite.phxsoftware.com/

本体はManaged DLL1個。組み込み用途としてお手軽。Javaにもこんなの(Pure Java SQLiteエンジン)があってもおかしくないと思ったが、JavaにはJava DB、というかApache Derbyがあるからいいのか？ごめんなさいよく知りません。', '2007-06-25 05:36:26+00', '2007-06-25 05:36:26+00');
INSERT INTO blogpost VALUES ('38b8da10-573c-4f03-8921-bea131b9e38e', '1998/7/30の日記', '村上春樹「パン屋再襲撃」を読む。この本は短篇集。思い込みかも知れないが、今までに読んだ事がある彼の小説は、「ある事件をきっかけに現実世界と自分との間に違和感を覚えはじめ、『僕』は戸惑うが、そのギャップと共に生きて行くしかないことに気付いている。」ってな感じの内容がが多かった気がする。彼のパロディを書くなら、「『混乱してるんだ。』と僕は言った。」とかいう文は外せないな。なんとなくそう思うだけだけど。ところで彼はロックが好きで、レッチリを聴きながらオープン２シーターでドライブするようなおじさんらしい。とてもいい人だ。', '1998-07-30 14:59:59+00', '1998-07-30 14:59:59+00');
INSERT INTO blogpost VALUES ('4fd5833a-795a-4c9c-8352-047fa0aa0950', 'ミスチルのCROSS ROAD←John LennonのWoman', 'John LennonのWomanを聴いた。

Mr. ChildrenのCROSS ROADのアレンジはこの曲を参考にしていると分かった。

ベストアルバムなら"Lennon Legend"がおすすめ。', '2008-01-18 16:19:24+00', '2008-01-18 16:19:24+00');
INSERT INTO blogpost VALUES ('6cdb467c-2c7f-4117-a043-5de466c41fe3', '1998/4/13の日記', '土曜日は昼前に起きて、バンド練へ。ハードロックなんて久しぶり。勘が掴めず苦労する。あまり家で練習していなかったのでボロボロ。でも2時間経つ頃には少しスムーズに出来た。まあ、簡単な方のパート担当なんだけど。でもChange Comes Aroundで、ギター弾きながらコーラス入れるのは難しそうだ。やばい。練習後は池袋のイシバシに寄る。会員カードを忘れたことに気付き、悔しいので何も買わずに家に帰る。夕飯はカレーを大量に作る。 

日曜日も、特にすることはない。田代と一緒に楽器店に行き、田代のためにギター教則本を選ぶ。 CD付きの教則本を買わせる。田代がバイトに行っている間にその本を借りて、家でCDを聞いてみた。これは結構面白い。一人で練習するのは退屈なものだけど、これだとバンドと合わせているような気分を疑似体験できる。思わず楽しんでしまった。 

その後、借りたプレステでバイオ2をする。 Easyモードにしてあるので結構スムーズに進むが、クラブの鍵が見つからない。チェスの駒の形をしたプラグの使用方が分からない。クランクの使い道が分からない。で、いまちょっと詰まっている。 

夜に「おしゃれカンケイ」を見る。ビビアン・スーがゲスト。ビビアンの姉と母が登場する。二人とも美人で、びっくり。

フリテンロンは、チョンボ。', '1998-04-13 14:59:59+00', '1998-04-13 14:59:59+00');
INSERT INTO blogpost VALUES ('e3bb3c6e-2713-4e0c-8445-98a195e4d77f', 'MSDN OnlineがRSS Feedを', '角谷HTML化計画より。

http://www.microsoft.com/japan/msdn/aboutmsdn/rss/

ちなみに「Java系の人々はMS関連のサイトをウォッチしてないのかな？」という発言のきっかけになった "Data on the Outside vs. Data on the Inside" ですが、私はTSS.NETのスレッドで知りました。（いずれちゃんと読もうと思ってメモしておいただけだったのですが。）', '2004-09-07 22:19:06+00', '2004-09-07 22:19:06+00');
INSERT INTO blogpost VALUES ('ff6f6819-2a67-4dec-bcb6-79e4e97ad765', 'Oracle開発用VS2003アドイン', 'http://www.oracle.com/technology/tech/dotnet/tools/index.html

こういうものがリリースされたんですね。これはありがたいです。', '2005-06-18 06:38:51+00', '2005-06-18 06:38:51+00');
INSERT INTO blogpost VALUES ('4e2443f6-6fd7-4499-af4f-4cca69bfe2b9', '餃子', '中力粉を購入。うどん用と書いてあるが、餃子に使えば皮だけでも美味しいということだろう。

餃子の皮を作る。お湯でこねる。塩を入れると粘りが強くなるらしいが今回は入れない。まとまってきたら乾かないように注意してしばらく寝かす。

その間に餃子の餡を作る。豚挽き肉に塩とこしょうと醤油と紹興酒とごま油を加えてこねる。その後ニラと茹でキャベツ（白菜は時期外れなので）とニンニクをみじん切りして加える。おろししょうがも加える。

餡ができたら、寝かしていた生地を切り分けて伸ばしていく。まな板の水気を拭き取り打ち粉をする。テーブルにラップを敷いて作業してもいいかも。
ここで麺棒がないことに気付く。仕方がないので空き瓶を使う。くっつきやすいので打ち粉がさらに重要。

皮を伸ばす。素人の仕事なのでどんなに薄くしたつもりでも限界があるが、今回は水餃子目的なので問題なし。形も悪いが気にしない。

包む。皮が柔らかめだったので破らないよう注意する。ここでゼラチンで固めたスープなど入れるのもいいが、今回はやらない。

ぐらぐら茹でる。強火がポイント。

酢醤油で食う。うまい。', '2005-08-21 06:48:02+00', '2005-08-21 06:48:02+00');
INSERT INTO blogpost VALUES ('965fe9ce-8aff-4241-9457-38dbb974b9ac', 'ワンス・オブ・センダー', 'ナハッ

えーと、仕事してないときはこういうことばっかり考えています。', '2007-05-02 22:51:59+00', '2007-05-02 22:51:59+00');
INSERT INTO blogpost VALUES ('28ed6330-d123-46cd-b7e8-651e3c15fd10', '.NEt Framework 3.0でた', 'Microsoft .NET Framework 3.0 Redistributable Package

いそがしくなるかな？', '2006-11-07 13:06:25+00', '2006-11-07 13:06:25+00');
INSERT INTO blogpost VALUES ('9a3ff811-202e-4e3a-b9d2-03c2ebef1ccc', 'visual_studio.vim', 'visual_studio.vim

おれはvi使いじゃないけど、一応。

日本語環境だと文字コードがらみでエラーが出るらしいけど、その辺りを解決してる人たちもいるようだ。', '2008-08-23 00:35:59+00', '2008-08-23 00:35:59+00');
INSERT INTO blogpost VALUES ('203568c9-ab6c-4706-a1e5-2cfb088ab931', 'Data on the Outside vs. Data on the Inside 日本語訳', '9/8に書いた "Data on the Outside vs. Data on the Inside" ですが、「外部のデータと内部のデータ」というタイトルで日本語訳が出てました。', '2005-02-27 07:06:22+00', '2005-02-27 07:06:22+00');
INSERT INTO blogpost VALUES ('6c260972-2cfa-494e-a4e5-b74a5f39c4fa', 'システムリソースが不足するため、APIを終了できません。', 'メモリを1GB以上積んでいるWindows XP sp2マシンで掲題のエラーが出る人は、KB909095をインストールすると直る……かもしれない。

……こういう記事を書くと、ここばっかりページビューが上がるんだよなあ。crypt32の記事も常にアクセスがあるからなあ。', '2007-07-24 04:40:12+00', '2007-07-24 04:40:12+00');
INSERT INTO blogpost VALUES ('0d4f3a60-917a-4b87-8509-528e28115a59', 'textareaをエディタで編集', 'する、It''s All Text!みたいなののInternet Explorer版を作ったよ！

もちろんSleipnirでも使えるよ!

でもどうせみんなFirefox使ってんだろうと思うと、公開するモチベーションはあがらない。', '2008-05-09 08:42:53+00', '2008-05-09 08:42:53+00');
INSERT INTO blogpost VALUES ('ba80fb48-d380-497c-92ea-c4d2513380f1', '10th p.c.', 'あっさり終わる。こんなんでいいのかな。', '2014-09-19 01:19:00+00', '2014-09-19 01:19:00+00');
INSERT INTO blogpost VALUES ('d8030019-f219-4fdc-a06f-fd4ef57aedc0', 'textareaをエディタで編集 (2)', 'するツールの続き。

CodeReposに登録してみた。

インストーラー

ソースコード

ソースコードレポジトリ(CodeRepos)

運用ルールをまだよく分かっていないので迷惑をかけていたらごめんなさい。', '2008-05-12 16:32:57+00', '2008-05-12 16:32:57+00');
INSERT INTO blogpost VALUES ('14143beb-e5a3-40a8-a0ca-be24d91550c1', 'ときメモ', 'ときどきメモリ不足。', '2000-08-16 14:59:59+00', '2000-08-16 14:59:59+00');
INSERT INTO blogpost VALUES ('c930064e-c13a-4fc0-8752-11ea97f4d16c', '中島聡氏　×　海部美知氏　トーク＆サイン会に申し込んだ', '(これのことです)(本文なし)', '2008-02-29 06:12:41+00', '2008-02-29 06:12:41+00');
INSERT INTO blogpost VALUES ('c84976ed-597a-474b-a02e-025330419b6e', 'ドイツ記', 'ドイツ旅行で心に残ったうまいものを書くよ。

(1) ギャートルズ肉

ドイツはバイエルン地方の伝統料理、シュヴァイネハクセ(schweinehaxe)。

豚すね肉のローストなのだが、とにかくデカイ。そして骨付き。

味は癖がなく、やわらかく、うまい。（うまかった。）

(2) 黒い森のサクランボトルテ

ドイツの有名な針葉樹林地帯、それがシュヴァルツヴァルト (Schwarzwaeld) 。「黒い森」という意味。

この地域の伝統菓子が、シュヴァルツヴァルター・キルシュトルテ (Schwarzwaelder Kirschtorte) 。「黒い森のサクランボトルテ」という意味。

上品な味で、これもうまい。

(3) ビール祭

この次期、ミュンヘンでは年に一度のオクトーバーフェスト (OktoberFest) が行われる。

会場には巨大テントが10数個立ち並び、そのすべてがビアホールなのである。

その中で"Ochsenbraterei"に入る。

1リットルジョッキになみなみと注がれたビールを片手に「乾杯！」

ビールも美味かったが、食事も最高だった！

ファインステ・バイエリシュ・オクセンレンデ(Feinste Bayerische Ochsenlende)。上サーロインのバイエルン風。

すっげーやらかくて、そしてソースもうまい！

(4) 白ソーセージ

ビール祭の開催地であるミュンヘンの名物は、ミュンヒェナー・ヴァイスヴルスト (Muenchener Weisswurst)。白いソーセージ。

茹でて、皮をむいて食べる。上手にむくのはなかなか難しかったぞ。

わりにあっさり味。 

(5) 秋の料理

この時期は収穫を祝う時期。ということでこの時期にしか食べない料理をいただく。

ツヴィーベル・クーヒェン (Zwiebelkuchen)。

玉ねぎケーキという意味だけどお菓子ではなくてキッシュみたいな感じ。

これに、フェーダー・ヴァイサー (Federweisser)という、今年仕込んだ醗酵途中のワインを合わせていただく。

ワインは「羽毛の白」という名の通り、白く濁っていた。

(6) カレーソーセージ

名前もそのまま、カリーヴルスト(currywurst)。

ソーセージを焼いてケチャップとカレー粉をかけたもの。

単純だがうまい。街中でよく売っているもののひとつ。

カリーブルストは、パンもしくはポム・フリと一緒に食べる。

ポム・フリは、正確にはポム・ドゥ・テール・フリ (pommes de terres frites) というのだが、縮めてポム・フリと読んでいるらしい。ポム・ドゥ・テールはフランス語で「地面の林檎」すなわち「じゃがいも」のことらしい。フリはフランス語でフライのこと。そう、結局はフライドポテトのことです。

しかし、なぜフランス語？そういえば英語でもフレンチ・フライと言うよな。

(7) 鶏の丸焼き

これも街中でよく売っているもののひとつ。

ヘーンヒェン(haehnchen)というのは若鶏のことを指すのだが、

ドイツでは鶏の丸焼きの代名詞となっている。

こんがりローストした後、1/2羽をいただく。

皮はパリパリ、中はジューシー！
', '2004-10-04 06:39:03+00', '2004-10-04 06:39:03+00');
INSERT INTO blogpost VALUES ('42b47a37-3973-4bbe-afc8-b4fee67bf42e', 'trueSpaceは、Expression 3D (仮) になるはず', 'Microsoft、3Dモデリングソフト「trueSpace 7.6」無償公開 - Internet Watch

WPFには3D機能があるけど、現状のExpressionシリーズには3Dモデリングツールが含まれてないからね。

ドローソフトの"Expression"がMSに買収され、一旦無償公開され、コードネーム"アクリル"となり、最終的にはExpression Designになっている事例を踏まえれば、今度もたぶんそうなる。

あとで英語サイトの情報をあたってみる(まだやってない)', '2008-07-28 00:59:35+00', '2008-07-28 00:59:35+00');
INSERT INTO blogpost VALUES ('b6c9e231-6c87-4f79-95b2-9b82d0c6692c', 'みんなで作る Tech･Ed 2005', 'GotDotNet JapanでのMS長崎さんの投稿によると、今年のTech Edのセッションテーマを公募するそうだ。

僕自身は、新技術に興味があるのは当然だが、パフォーマンスチューニングやデバッグの実践的な手法（たとえば、パフォーマンスカウンタをどう読んでどうフィードバックするか）なんてことにも関心がある。

他の参加予定のみなさんは、どんなことに興味をもっているんでしょうか。それも含めて楽しみです。

', '2005-03-17 03:32:18+00', '2005-03-17 03:32:18+00');
INSERT INTO blogpost VALUES ('843cc469-c530-4ce5-8563-ed9102033562', '明日は某プロジェクトのカットオーバー日', '明日、二年近く関わったプロジェクトが本番運用開始を迎える。

頭から最後までどっぷり関わったのは初めてだ。

利用者がそれなりに多いので、想像もしない障害が起きないかガクブルながらも、やっとここまできたかという感慨もあり。

祝杯呑みたいなあ。
', '2006-12-22 14:19:00+00', '2006-12-22 14:19:00+00');
INSERT INTO blogpost VALUES ('0750cacf-64b2-47e6-a0a7-6f933e20dce2', '1998/5/15の日記', '四宮が家に来た。昼、赤羽のラーメン屋に2人で行った。赤羽では旨いと評判の店だそうだが、実際、なかなか旨かった。特にチャーシューは良かった。ただ、セットメニューでついて来たチャーハンが最悪。ベチャベチャでひどかった。不満が溜ったのでその日の晩飯はチャーハンを作る事にした。ところが、私はチャーハンを作るのが久しぶりだったため、具が多すぎたり、ご飯が焦げ付いてしまうなどで、あまり上手にできなかった (それでも、その日ラーメン屋で食べたチャーハンよりはまともだった)。悔しかったので、リベンジを決行。翌日の朝食用としてもう一度チャーハンを作った。こんどはまあまあ上手くできた。ほっとする。四宮は朝6時からオペとの事で、始発を待って帰って行った。ほとんど寝てないのに、大丈夫か？

パラサイト・イヴをやった。面白いが難しい。そして、ちょっとだけバイオハザードに似ている。 ', '1998-05-15 14:59:59+00', '1998-05-15 14:59:59+00');
INSERT INTO blogpost VALUES ('354d9c7c-55a3-4260-ac08-34ba1eddaf72', 'ゲームブックの古典がiアプリで復活', 'http://slashdot.jp/article.pl?sid=03/10/02/0041206&amp;topic=31&amp;mode=nested

http://www.digitalstudio.co.jp/imode.htm

http://www.digiadv.co.jp/gamenovel/sorcery_01.html

社会思想社のアドベンチャー ゲームブックシリーズも創元推理文庫のソーサリー4部作もはまった人間としてはぜひプレイしたいのだけれど、俺はVodafoneユーザ…

ってかVodafoneでもリリースしてほすぃ。', '2003-10-02 10:05:03+00', '2003-10-02 10:05:03+00');
INSERT INTO blogpost VALUES ('73e3ca30-9b83-4287-b066-66a3eac4b8fd', '7th p.c.', '発育は順調。何より何より。', '2014-07-26 01:27:56+00', '2014-07-26 01:27:56+00');
INSERT INTO blogpost VALUES ('74a4f1e9-58d1-4079-9a2f-ea295ae4a206', '1998/4/7の日記', 'プロに仕事を依頼するなら、報酬はきちんと。', '1998-04-07 14:59:59+00', '1998-04-07 14:59:59+00');
INSERT INTO blogpost VALUES ('23c19839-cbf6-4404-94d7-88036fb237d5', '1998/5/11の日記', 'ここ数日する事無し。

由井君からプレステを借りる。(田代のは返した) ブシドーブレード弐を頑張っている。 100人抜きモードを出すまでは行ったが、 15分以内でクリアなんて、できるかー！！ 

hideのトリビュートバンドを計画中。こういうのは今やっておかないと。ただ、企画倒れにならなければいいんだけど。 

母から電話があった。実家に帰った時にデパートでワインを買って、母の日に実家に届くようにしてもらっていたが、それが届いたとの事だ。私がこういうことをするのは滅多に無い。今回も単なる思いつきだったのだが、喜んでくれたようで、良かった。ただ残念な事が一つある。私も飲んでみたかった。フルーリー。 ', '1998-05-11 14:59:59+00', '1998-05-11 14:59:59+00');
INSERT INTO blogpost VALUES ('103e9e89-a55d-4049-8c27-af257e034b0c', '1998/9/14の日記', 'しのことカズと津田君と私の4人で、PSの「メタルギア・ソリッド」をプレイ。元ＭＳＸヘビーユーザーにはたまらないものがある。夜中ぶっ通しで12時間やり続け、ついにクリア。グリズリーの称号をゲット。エンドクレジットに小野田さん(研究室の先輩で、コナミに入社した人)の名前が堂々と出ていた。すごい。小野田さん、今度会ったらアイテムの「バンダナ」の使い方と、ゲーム中に何故か出てきた「ヒデオ」の表示(テレビの入力切り替えを「ビデオ」にして、ビデオやゲームの電源を入れてない時に出るアレにそっくりだが、でも「ビデオ」ではなく「ヒデオ」)の意味を教えて下さいね。 ', '1998-09-14 14:59:59+00', '1998-09-14 14:59:59+00');
INSERT INTO blogpost VALUES ('c9115e20-3fea-4bd6-8e04-ce54ab239090', '去年のプリキュア', '2ちゃんねるまとめサイトの「秀逸なベースラインの曲を挙げよう」を読んでたら、スイートプリキュアの曲が3回も挙がってた。

我が意を得たり。この曲、自分でも気になってたんで、コピーしてみたことがある。（グリッサンドを省略してるのが残念だけど）

http://dl.dropbox.com/u/130665/sweetprecure.mid

下手なギターも合わせてみた。', '2012-07-17 02:36:31+00', '2012-07-17 02:36:31+00');
INSERT INTO blogpost VALUES ('6a686016-f247-4e4a-9d75-1e9687e4575f', 'Patterns of Enterprise Application Architecture', 'Martin Fowlerのアーキテクチャパターン本(ISBN:0321127420)。

http://www.kk.iij4u.or.jp/~y-kamite/book/fowler_enteprise.html

http://www.martinfowler.com/eaaCatalog/

当たりをつけてから読み始めよう。', '2003-06-24 09:55:32+00', '2003-06-24 09:55:32+00');
INSERT INTO blogpost VALUES ('043b124f-e793-4fdf-b37a-31fe7c217737', 'Yakety Yak', 'Hackety Hackを見て思い出したのが、The Coastersの"Yakety Yak"という曲。映画"Stand By Me"のサントラに入っていたなあ。

  散らかした紙くずを捨てなさい
  じゃないとお小遣いあげない
  台所の床も磨きなさい
  じゃないともうロックンロールさせない
  無駄口叩かない 口答えしない

  部屋の掃除はちゃんとやりなさい
  ほうきで余計にほこりが舞ってるじゃない
  そのがらくたは全部片付けなさい
  じゃないと金曜の晩に遊びに行かせない
  無駄口叩かない 口答えしない

  コートを着て帽子をかぶりなさい
  そしたらコインランドリーに行ってきなさい
  終わったらワンちゃんを部屋に入れなさい
  入れ替わりに猫ちゃんは出しなさい
  無駄口叩かない 口答えしない

  そんなだらしない格好しない
  お父さんを見習って格好よくなさい
  不良のお友達は帰ってもらいなさい
  車を運転する年にはまだ早い
  無駄口叩かない 口答えしない

んー。50年前のアメリカでも、母ちゃんはやっぱりやかましい。', '2007-05-18 01:56:19+00', '2007-05-18 01:56:19+00');
INSERT INTO blogpost VALUES ('41d7887a-0dfc-42e2-820a-0d71a99a2283', 'ファーム構成でのSessionState', 'Scalable Session-State Storage for ASP.NET Server Farms Released (TSS.NET)

Javaの話ですが、WebLogic Serverにはインメモリ レプリケーションという機能があります。

.NETのステートサーバーは、インメモリだと多重化できないし、SQL Serverだと遅いし、なので、「ASP.NETのセッションステートもインメモリ レプリケーションできたらいいな」と思っていたのでした。

いやまあ、どこにもないものならば、作ればいいんですけど。

', '2005-02-01 03:15:19+00', '2005-02-01 03:15:19+00');
INSERT INTO blogpost VALUES ('887add63-9da2-47ba-850a-862b5f8bb27a', '他のVS拡張より便利？CodeRush', '[あとで書く]

オフィシャルサイト

紹介(日本語)

紹介(英語)
', '2007-01-31 05:46:14+00', '2007-01-31 05:46:14+00');
INSERT INTO blogpost VALUES ('f6b526e6-8178-4846-b164-4d33188bad44', 'IronPython', 'CPLからShared Sourceに変わったのはその通りなんだけど、Shared Sourceといっても1種類ではなくって、ソフトウェアによってその内容は変わるので、毎回きちんとライセンス条項を読まないとだめぽ。

http://www.gotdotnet.com/workspaces/License.aspx?id=ad7acff7-ab1e-4bcb-99c0-57ac5a3a9742

FAQのところに「OSI準拠ではありません」と書いてある。それはいいんだけど、不勉強なもので、どの条項がOSI基準を満たしていないのかよくわかってないです。誰か教えてくれないかなあ。', '2005-04-01 07:03:55+00', '2005-04-01 07:03:55+00');
INSERT INTO blogpost VALUES ('4a53ab30-23e8-4fb8-b2bd-817bd31e264e', '1998/7/7の日記', 'アシモフのファウンデーションシリーズ第５作「ファウンデーションと地球」を読む。今まで出てきた設定や謎を矛盾無く説明し、かつアシモフの陽電子ロボット物との融合を図った作品。おかげで説明っぽくなってて、３作目までのカタルシスが本作では薄かったように思える。読んでいて、編集者であるキャンベルが持つ「アメリカ人至上主義」 (このことはアシモフ初期作品集の中で言及されている) への反論という裏のテーマもあるのかなあと感じた。深読みしすぎか？まあ何にせよ、この続きはもう出ない。続編を匂わせる終わり方だけに残念。 

ピアズ・アンソニィの魔法の国ザンス(The Magic of XANTH)シリーズ第８作「幽霊の勇士」も読んだ。このシリーズは高校の時に読んでいたもので、続きを読むのは久しぶり。いまさらファンタジー物も照れるが、好きなんだから仕方無い。それに、最近よくあるアニメ系ファンタジー物とは段違いに面白い。内容は、相変わらずのザンスっぷり。剣と魔法はともかく、何だか良く分からない英語の駄洒落あり(っていうかこればっか)、ちょっとしたお色気あり(コウノトリにメッセージを届ける方法、なんていう表現が出てくる。幽霊になった剣士が生前の話を５歳の女の子に語っている時に！)。ぼけーっと読んでいたので、最後のどんでんがえしを全く予想していなかった。隙あり一本。', '1998-07-07 14:59:59+00', '1998-07-07 14:59:59+00');
INSERT INTO blogpost VALUES ('d4a4be59-0700-4035-a0c3-cff0ef2fb953', '財布を忘れて', '新宿でのミーティングに向かう途中。

バスに財布を置き忘れた。

バスから降りて、電車に乗り換えようとしたときに気づいて真っ青。

幸い、親切な方が東京駅の交番に届けてくれたそうだ。

いま、取りにゆきます。

おかげでミーティングに遅刻。関係者の方々すみませんでした……', '2005-06-23 07:58:12+00', '2005-06-23 07:58:12+00');
INSERT INTO blogpost VALUES ('83bcff8c-c7a9-4c18-9a5d-713a7972fea7', 'IronLisp？気が知れない', 'IronLispってのが開発されているらしいが、正直どうでもいい。

Lispを使いたいということなら.NETにこだわらずに別の処理系を探せばいい。本気で仕事に使うっていうならそれに向いたLispもあるし、遊びだっていうなら例えばJavaで実装されたLispもいっぱいある。

.NETにこだわりたいんだとしても、.NET Framework上に実装されたLispですらいくつかあるわけだし(DotLispとかL Sharp .NETとか)、そっちで用が足りるのでは。

Paul Grahamに感化されたのか何なのかは知らないが、今さら「へーIronLispってのがあるんだー。」って意味わかんない。そんな人はきっとIronLispを動かすこともなく忘れていくんだろうさ。つか、そんなにLispに興味があるなら自分で処理系を書いてみればいいのに。', '2007-08-29 01:12:14+00', '2007-08-29 01:12:14+00');
INSERT INTO blogpost VALUES ('889d2a04-dd21-43c9-895d-8ae19cd5adaf', 'Improving .NET Application Performance and Scalability', '関田さんが書かれていたように、日本語訳されたので読みやすくなった。

http://www.microsoft.com/japan/msdn/enterprise/pag/scalenet-intro.asp

なにしろPDFで1000ページ超。もー大変なんですから。', '2005-08-05 22:49:26+00', '2005-08-05 22:49:26+00');
INSERT INTO blogpost VALUES ('824094b6-2d90-43cd-b318-fbaf79acbb55', '川崎チネチッタでHot Fuzz観たよ', 'すっげー面白かった！！！

(あとで詳細書くかも)', '2008-07-13 14:47:41+00', '2008-07-13 14:47:41+00');
INSERT INTO blogpost VALUES ('0f2d1c0f-ec71-4023-9ccd-eb703fab8023', '一歳半検診', 'これまでかかりつけだったとこではなく、近くに新しくできたクリニックにて検診。

特に問題なく、順調な発育の模様。

30分強で終わりました。', '2016-05-07 01:47:16+00', '2016-05-07 01:47:16+00');
INSERT INTO blogpost VALUES ('05f3e983-0723-44c1-8f7c-a0f05c3dffee', 'Webサイトを分けます', '技術ねたははてなダイアリーと個人サイト(準備中、Wikiがいいのだけれど)に書こうと思います。

猫は……どうするかな。', '2008-12-14 14:43:48+00', '2008-12-14 14:43:48+00');
INSERT INTO blogpost VALUES ('89078080-f442-4e2f-a516-f00d744c60c6', 'キュキュットさん', '会社の同じフロアにいる人が花王「キュキュット」のキャラにちょっと似てる。

キュキュットファミリー

すげえどうでもいい更新。', '2010-01-30 02:20:08+00', '2010-01-30 02:20:08+00');
INSERT INTO blogpost VALUES ('5086af5c-5e50-46ff-9dab-6dcce0e13f6c', 'The Complete Guide To Developing .NET Enterprise Web Applications', 'MSのコンサルタント、赤間さんが「.NETエンタープライズWebアプリケーション開発技術大全」という本を執筆されました。

そして、書籍と連動して@ITで抜粋の連載が始まりました。要チェックです。', '2004-04-22 02:05:38+00', '2004-04-22 02:05:38+00');
INSERT INTO blogpost VALUES ('41fc291c-ce1f-4265-be35-eac2b78054d1', '典型的な、あまりに典型的な', '前に記事を書いた話題がまだ続いている。

「典型的」と言ってもね、typicalとstereotypedとではニュアンスが変わってくるし、それももめる原因になるなあ。

もちょっとこう、You vs. I ではなく Problems vs. Us で論じたほうが良いわけなんだが、Problemsの中にJavaを入れるのは下策ではないのか。

たとえばね、「典型的」という言葉を「典型的なSI脳」とかにしたらどうだよ。ここでは、「典型的なSI脳」＝世間的な潮流に乗っかることがエンタープライズとか大規模とかでは重要という考え方、ぐらいの意味。「メインストリーム幻想（ファンタジー）」とでも言うか。

そうすると、「典型的なSI脳」だと、自分の頭で考えることが逆にマイナスだったりする場合もある。それは、技術的に優れていることよりも、技術者の調達とか教育とかを低リスクにすることの方が重要だと信じているから。

で、「典型的なSI脳」を持ったJava開発者のことについて論じてみてはどうか。

上のような定義だと、「典型的なSI脳」を持ったRuby開発者なんてきっとほとんどいないことだろう。それが良いことなのかは別だけどね。

SI脳。yes, I Know. 腹減ったからカレー食おう。

(追記)ひがさんとこでは「サラリーマンプログラマ」＝技術的な興味はほとんどなく仕事として黙々とこなしている人、という定義で話を進めてるな。それはruby界にはほとんどいなくて、でもそれが良いことであるとは限らないことも同じ。', '2008-05-18 03:23:04+00', '2008-05-18 03:23:04+00');
INSERT INTO blogpost VALUES ('3a7312c4-00a0-4879-b1a4-a7627ad1fe33', '深夜の酔っ払いパワー', '今、朝の六時半。

何故だろう？

朝の井の頭公園。

何故だろう？

昨晩は新宿で飲んでいたのに。

何故だろう？

12時には原宿にいた。

何故だろう？

1時には渋谷にいた。

何故だろう？

何故こんなに足が痛いのだろう？

何故俺たちは松屋で朝飯を食っているのだろう？', '2000-11-05 14:59:59+00', '2000-11-05 14:59:59+00');
INSERT INTO blogpost VALUES ('62584654-e344-4452-bae0-025e067f2325', 'かみ合わない会話', '先輩「俺、たまに一人で蕎麦屋に行ってお酒とか飲むんだけど」 

後輩「え、一人でですか。寂しくないですか。」 

　　「俺、この前一人で“てんや"に行ってビール飲みましたよ」 

……上記の「寂しくないですか。」は、ぜんぜん疑問文ではなくて、「え～それってチョー寂しくな～い？」といったニュアンスでの発言でした。

僕は横で笑いをこらえていました。', '2005-03-11 05:30:24+00', '2005-03-11 05:30:24+00');
INSERT INTO blogpost VALUES ('6b2b7161-0a19-4a7f-b253-15999564ecb9', 'ブラックホール? Google', 'Project Looking Glassで有名な川原英哉さんもGoogleに転職していたとは。(古川亨ブログで知った)', '2008-03-17 22:57:51+00', '2008-03-17 22:57:51+00');
INSERT INTO blogpost VALUES ('4e57b628-e2f1-43f2-b9ff-f349579fae03', '1998/9/1の日記', 'うわー、もう9月かあ。 

深夜テレビで芝居を放送していた。ラッパ屋「阿呆浪士」。なんか観てたら面白くて朝まで観てしまった。次回は由井君がレポートしていた「唇からナイフ」だそうだ。 

みうらじゅん、泉麻人をプロデュース。すっげー笑える。 

鈴木その子、超恐い。 

NTTパーソナルのPHSで「きゃらトーク」というサービスが始まり、 DDIのPメールとの間で送受信が出来るそうだ。工事費1000円かかるって事だけど、やってみようかな。 

「きらきらひかる」を読んだ。うんうん確かにいい話。ハッピーエンドのように見えるが実はハッピーエンドではないように感じた。 

しのこから「ベルセルク」を全巻借りて読む。やっぱ面白いっす。この漫画。アニメもいいけど、コミックスの方が好みだ。早く続きが読みたい。 

13星座は定着しなかった。よしよし。危うくへびつかい座のシャイナさんが白銀聖闘士から黄金聖闘士に格上げされるところだったぜ。', '1998-09-01 14:59:59+00', '1998-09-01 14:59:59+00');
INSERT INTO blogpost VALUES ('e9cec336-76cd-45c8-af81-80fa0489c249', '今週のアリー２', 'ネルにはまってます。

ネル役の女優さん、スクリーム２にも出てたみたいだ。', '1999-11-29 14:59:59+00', '1999-11-29 14:59:59+00');
INSERT INTO blogpost VALUES ('d78daa31-cff0-4b58-80be-b76656974853', '広末が若い', '津田君と一緒に「２０世紀ノスタルジア」を見る。

２人で大爆笑。ニューロンばちばち！', '2000-03-18 14:59:59+00', '2000-03-18 14:59:59+00');
INSERT INTO blogpost VALUES ('91450a2e-f320-4793-87ae-eb564787d1db', '駄洒落', '「ovenで炙んの？」

「なんでそんな英語っぽい発音なの？」', '2008-10-02 14:20:47+00', '2008-10-02 14:20:47+00');
INSERT INTO blogpost VALUES ('b986183e-b2fb-4046-b5c0-75c92191c9de', 'クライマックス刑事', 'ネタバレする気はないけど、一言感想だけ書いておく。

面白かったよ。でもね、もともとVシネマだった事を忘れてはいけないと思うんだ。
', '2008-04-20 14:30:12+00', '2008-04-20 14:30:12+00');
INSERT INTO blogpost VALUES ('8cde699a-d48e-4468-afa8-f3a2e5bc7a65', 'UIパターン その2', 'こっちにまとめた。', '2008-09-17 22:15:01+00', '2008-09-17 22:15:01+00');
INSERT INTO blogpost VALUES ('27149774-9e75-46ab-833b-6adc52a4e6aa', 'Fleverlight勉強会 vol.2 行ってきた', 'はてなダイアリーへ移動しました', '2008-11-23 05:33:33+00', '2008-11-23 05:33:33+00');
INSERT INTO blogpost VALUES ('44266468-986f-4d53-94c7-d38a3882bfa8', 'VS2005 Team Suite RC (Japanese)', 'MSDNサブスクライバダウンロードに出てますね。
MSCに何とかRCを間に合わせた、というところでしょうか。', '2005-11-15 09:09:25+00', '2005-11-15 09:09:25+00');
INSERT INTO blogpost VALUES ('83fb402e-4f9c-4f56-8ae1-31cbf33d8e56', '1998/4/1の日記', '普連土(ふれんど)学園、三田にて発見。', '1998-04-01 14:59:59+00', '1998-04-01 14:59:59+00');
INSERT INTO blogpost VALUES ('da55529d-10bd-437e-84cc-b40d6d4e9540', 'うずくまって泣いててもはじまらないからtough boy', '肥え続けるTomcatと胃を痛めるトラブルハッカー

うわぁ……Tomcatメモリリークの解析……すごく生生しいナリ……

これ、Tomcatの不具合をテーマにしてるとはいえ、対岸の火事だと思わないほうがいいよね。', '2007-11-30 09:21:53+00', '2007-11-30 09:21:53+00');
INSERT INTO blogpost VALUES ('91701461-e364-4244-a978-01395d41832d', 'UIパターン その1', 'こっちにまとめた。', '2008-09-12 14:23:48+00', '2008-09-12 14:23:48+00');
INSERT INTO blogpost VALUES ('913f73a3-5220-43a1-a472-c95700fdbc3c', 'ロマンティックあげるよ', 'あれ可笑しいな、涙が←マジ話

http://www.youtube.com/watch?v=HKafAQ0XUd0

いや確かに世代的にストライクなんだが、そもそもこの曲すげえ好きなんだよな。あんまり言ったことはないけど。

しょこたんのカバーはあまりに原曲のままでひねりはないんだけど、なんというかまっすぐなんだな。てらいがないというか。そのまっすぐさに打たれた。

映像もよかった。ピルクルとかはどうでもよくて（笑ったけど）、ブルマのコスプレ。これコスプレしたいというだけでとらえてはだめだよね。なんていうか、私も冒険したいんだ、実際には空想するしかない、でも空想の中では私は主人公で、ドラゴンボールを探して冒険しているんだ、みたいなところがよく表現されていて、ちきしょう誰が監督しやがった、泣かせやがって許さねえ。

Amazonの商品説明がすごいことになってるなあ。', '2007-04-07 07:40:03+00', '2007-04-07 07:40:03+00');
INSERT INTO blogpost VALUES ('a870b231-b90f-486d-b082-2fd71a35965d', '不在のお知らせ', '知人以外どうでもいい話だが。

5/24～6/6まで旅行に行ってくる。6/2まではインターネットにもアクセスしない(できない)ので悪しからず。', '2007-05-19 17:20:54+00', '2007-05-19 17:20:54+00');
INSERT INTO blogpost VALUES ('47f9fe8a-28ef-42ba-94d3-f518c16278ce', '今更エヴァンゲリオン', '「使徒」と「ヒト」を区別できないのは江戸っ子だからか？', '2001-01-27 14:59:59+00', '2001-01-27 14:59:59+00');
INSERT INTO blogpost VALUES ('4d825c6a-6918-45ca-81cf-89ff10a5a8b3', '深入り.NETプログラミング', 'NyaRuRuさんが@ITで連載を始めた。

第1回目は、インライン・メソッド・キャッシュによる動的ディスパッチ高速化。

さまざまな文献を参照しながら動的型の実装例を解き明かしていく。

NyaRuRuさんは日本でも3本の指に入る.NET Hackerだと思う。来年もいろいろ書いてほしいものだ。', '2008-11-18 23:10:48+00', '2008-11-18 23:10:48+00');
INSERT INTO blogpost VALUES ('7fcee165-c4c4-489d-a6f4-6d6c5ce29df4', '映画「バベル」を観てきた', '連休中にMOVIX宇都宮で「バベル」を観た。

世界には生と死とコミュニケーション不全が満ちていることを思い出させる。考えさせられるいい映画だった。(きっとディパーテッドより断然こっちが好きだな、ディパーテッドもインファナルアフェアも観てないけど。)

義母は「各国の話がもっと有機的につながってくるのかと思っていた」と言っていたけど、「一発の銃弾が、モロッコ、メキシコ、日本を撃ち抜く」みたいな煽り宣伝が間違い。つなげることは主眼ではないようだから映画としてはまったく問題ないと思う。

イニャリトゥ監督のことは良く知らない(アモーレス・ペロス観てないし)けど、世界の見つめ方がすごいなと思った。モロッコパートでもメキシコパートでも心を強く揺さぶられた。日本パートだけ取り出してもすごい。なんと言うか「外国人から見た日本」みたいな切り取り方はまったくなかった。日本そのものだったと思う。(菊池凛子演じる女子高生は欲求が不満しているけど、コミュニケーション欲求なんだな。)

余談だが、あのペントハウスが佃のdankogai宅なんだね。さすがにいい所に住んでいらっしゃる。', '2007-04-30 00:27:37+00', '2007-04-30 00:27:37+00');
INSERT INTO blogpost VALUES ('d99df5f6-3eda-4d54-9b0a-a63949412709', 'ヤマハ、「POD」のLine 6を完全子会社化', 'ヤマハ、「POD」のLine 6を完全子会社化

CubaseのSteinbergも、PODのLine6も、どっちもYamahaになるんだなあ。', '2013-12-22 09:26:26+00', '2013-12-22 09:26:26+00');
INSERT INTO blogpost VALUES ('a797f26d-f9ee-42c2-8493-8ce1b935d75d', 'Visual Studio 2005 RC1', 'PDC中に出ました。
サブスクライバダウンロードでScriptエラーが発生してうまくダウンロードできなかったけれど、「個人用コンテンツ」を編集して、表示項目を減らしたらなぜかエラーが起こらなくなった。

', '2005-09-15 02:42:45+00', '2005-09-15 02:42:45+00');
INSERT INTO blogpost VALUES ('7a10a4a3-9d1e-46f3-adf7-66f117564955', 'シンガポールに戻ってきた', 'もう数日したら日本に戻ります。', '2007-06-02 01:29:14+00', '2007-06-02 01:29:14+00');
INSERT INTO blogpost VALUES ('2ac57264-b3bf-4a39-bb6b-a771b26aa00c', 'Wiiリモコン用のライブラリ', 'CodePrexにWiiリモコンを使うためのライブラリが登録されている。

ムッハー、きょうみぶかあい。(Wiiは持ってないけど)', '2008-01-08 05:20:37+00', '2008-01-08 05:20:37+00');
INSERT INTO blogpost VALUES ('7c1b50dd-2743-48cb-951b-b6c3c83edbca', '笑いをかみ殺した', '電車の中で、ワープロで作られたと思しきプリントを何度も読み返しながら、蛍光ペンであちこちマークしている、スーツ姿の人を発見。

何をそんなに熱心に確認してるんだろう…と、こっそり覗き込むと、そこには、「３行統一記念　世紀末ゲーム大会！」というタイトル。

…忘年会の台本だった。

きっとＦ銀行あたりの行員さんなんでしょう。お疲れ様です。', '2000-12-17 14:59:59+00', '2000-12-17 14:59:59+00');
INSERT INTO blogpost VALUES ('2cef6159-3ba8-4ae8-bb2b-317b3d0512bc', '1998/4/27の日記', '想像するだけで嫌なもの。赤井英和と大仁田厚の女性論トーク。', '1998-04-27 14:59:59+00', '1998-04-27 14:59:59+00');
INSERT INTO blogpost VALUES ('f02f2b0f-23c6-4fbb-8509-96442dc2996d', 'カルロス・ゴーンの物語', '遠い海からきたCOO(シーオーオー)。', '2000-06-13 14:59:59+00', '2000-06-13 14:59:59+00');
INSERT INTO blogpost VALUES ('13c3060f-e4b9-40dd-b5f7-fab0cf2f66cd', 'JavaのいろんなORMのクエリとLINQを見比べる', 'はてなダイアリーへ移動しました', '2008-12-10 01:05:34+00', '2008-12-10 01:05:34+00');
INSERT INTO blogpost VALUES ('54047faf-22b4-41db-8594-1a129c8dc653', '歯医者に行った', 'これまで歯医者にはほとんど行ったことがなかったのだが、口の中が腫れたため病院へ。

案の定、ひどい虫歯とのこと。親知らずの虫歯が特にひどく、口腔内を圧迫しているので腫れているそうだ。「これは抜くしかないですねえ」

というわけで麻酔をかけて引っこ抜いたのが今日。この後も他の歯の治療に通う必要がありそう。', '2013-02-14 02:46:28+00', '2013-02-14 02:46:28+00');
INSERT INTO blogpost VALUES ('b97193eb-2630-4938-9aaf-b71f38454797', '両親＆姉家族、来米', 'タイムラインを記録しておこう。

8/12……姉家族（姉＋義兄＋甥っ子）SFOに到着→SFに移動。迎えに行くなどはしていない。

8/15……姉家族、SFのホテルをチェックアウトし、我が家に一泊。サンタクララのWhole foods marketでピザなどを買ってきて家で食べたのだが、これがけっこう美味かった。その時あけたLichen Estateの白ワイン（Pinot Gris）も良かった。

8/16……姉家族、サンノゼダウンタウンのホテルに移動。義兄はここから数日忙しい。我が家の3人＋姉＋甥っ子の5人でSan Jose Vietnum Town内にあるDynasty Chinese Seafood Restaurantで夕食。ここはすごく広くて基本的にガラ空きだけど味は悪くない。この日は近隣の高校のとある部活のパーティーみたいなのをやってた模様。

8/17……両親がSFOに到着。我が家の3人＋姉＋甥っ子の5人でお出迎え→SF観光。まずはゴールデンゲートブリッジを車で渡ったところにある駐車場で小休止。Sausalitoには行かず、また橋を戻って今度はLombard Streetのジグザグ坂へ。それからFisherman''s WharfのBoudin Bakery & Cafeに行ったけども2階のレストランが45分待ちということでPier 39の方のBoudinでクラムチャウダー。食べ終わったらアルカトラズ島を遠くに眺めながら車に戻り、AT&T Parkの前を通過してTwin Peaksへ。うちの娘が怖がって泣いてしまうハプニングもありつつ、いったん我が家に帰り、それからBlack Angus Sunnyvaleで肉を食べ、姉＋甥っ子をホテルに送る。

8/18……我が家3人＋両親が姉＋甥っ子と合流してSwanton Berry Farmでいちご狩り。Santa Cruzに移動してHula''s Island Grillで昼ごはん。San Joseに戻って姉＋甥っ子をホテルの近くにドロップし、帰宅。そのあとHouse Of Phoで夕飯。

8/19……両親と朝の散歩。朝ごはんの後、Campbellのファーマーズマーケットへ。姉＋甥っ子は電車（VTA）で合流。フルーツなどを買った後でUncle John’s Pancake Houseに行ってみるも混んでいたため、戻ってきてIl Sognoでビュッフェランチ。それからみんなでJohn D. Morgan Parkに行って子供たちを水遊びさせて、ミツワで買い物の後、我が家でカレーで食べて、姉＋甥っ子をホテルに送る。

8/20……義兄の仕事も終わり、姉家族がサンノゼダウンタウンのホテルからサンタクララのホテルに移動する日。両親と朝の散歩するも、父は時差ボケでダウン。我が家3人＋母は、Whole Foods Marketで食べ物を仕入れて、Castle Rock State Parkまでドライブ。そこでピクニックと短いハイキング。ピクニックの時にブリトーの中身（トルティーヤなし）を食べてたら肉に蜂がたかってきて焦った。ロスガトスのあたりで休憩後、我が家に戻る。それから、体調が回復した父を連れて、2人で野球（Oakland Athletics対Texas Rangers）を観にOakland-Alameda County Coliseumへ。妻と娘と母は姉家族と合流してRed Robinでハンバーガー。俺と父が7回表まで観て（Athleticsが7-0で勝ってた）帰ったころには姉家族は帰った後だった。

8/21……妻が娘をプリスクールに送った後、姉家族をピックアップしてRoaring Campへ。隣のHenry Cowell Redwoods State Parkを散歩した後で、蒸気機関車に乗って近隣を一周。それからSanta Cruz Wharfに移動して、FireFish Grillでシーフードを食べてSea Lions(カリフォルニアアシカ)を見て、娘を迎えに行って帰宅。しばらく一緒に遊んだ後で姉家族をホテルに送って行って、家で軽い夕食をとる。

8/22……両親と朝の散歩。姉家族をピックアップしてお昼にSavanna-Chanelle Vineyardsへ。ツアー＆テイスティングを予約していたはずがうまく伝わっていなかったようでちょっと困ったが、結局ツアー＆テイスティングをしてもらえた。そのあとにピクニックしてのんびりした後、Valley Fairのモール→Great Mallとはしごして（母に買ったCoachの小さな鞄が70% Offだった）、ミルピタスのShanghai Delightでみんなで中華を食べて、姉家族をホテルに送って行って帰宅。

8/23……姉家族の出発日＆両親の出発前日。ホテルをチェックアウトした姉家族をピックアップして我が家へ。ESLの試験に行った妻が買い物をして帰宅。いったん近所の公園で子供たちを遊ばせ、アパートに戻ってバーベキュー。牛、豚、鶏、エビ、トウモロコシなどをたらふく食べ＆前日のワイナリーで買った赤ワインを開け、のんびり。夕方にSan Brunoのホテルに移動。両親と我が家がチェックイン。姉家族も部屋で休憩しつつ、IHOPで夕食をとる。その後姉家族は深夜便に乗るため、俺がSFOまで送って行って見送り。

8/24……ホテルをチェックアウトして、両親をSFOに送って行って見送り。

 ', '2018-08-26 22:27:51+00', '2018-08-26 22:27:51+00');
INSERT INTO blogpost VALUES ('a61c4bd7-65a0-4612-8794-dfd3e27e0ad3', '1998/7/13の日記', 'Ｗ杯はフランスが優勝！あの強豪ブラジル相手に、しかも１人退場して１０人になったのに、３－０で勝っちゃうなんて。すげえ。', '1998-07-13 14:59:59+00', '1998-07-13 14:59:59+00');
INSERT INTO blogpost VALUES ('d47e5062-275a-4ba4-83b8-a4e8ac61840f', '6th p.c.', '順調のようで何より。', '2014-07-05 01:19:30+00', '2014-07-05 01:19:30+00');
INSERT INTO blogpost VALUES ('31686fd3-9594-41f2-8567-4f75b98555aa', 'C# 2.0の匿名メソッドは要注意', 'C# 2.0から加わるAnonymous Method。

私はよく確かめもせずに「クロージャ」「クロージャ」言ってましたが、
実は結構落とし穴がある、というか他言語のクロージャと同じような意識で利用すると失敗する危険性があることを知りました。

NyaRuRuの日記 - C# 2.0クイズを読んで、実行結果を予想してみてください。

やはり、どういうILにコンパイルされるのかを理解しないといけませんね。いや、冷や汗かきました。', '2005-10-29 15:09:48+00', '2005-10-29 15:09:48+00');
INSERT INTO blogpost VALUES ('212247f1-6ac1-43e4-867f-7ec346ce1ff5', '今日のdeja vu', '「みかんは天井にぶつけてから食うとウマイ」', '2000-01-11 14:59:59+00', '2000-01-11 14:59:59+00');
INSERT INTO blogpost VALUES ('96320953-7f27-4c23-b4a1-2956edcc7c27', '1998/9/27の日記', '信吾が東京に来た。', '1998-09-27 14:59:59+00', '1998-09-27 14:59:59+00');
INSERT INTO blogpost VALUES ('2aaea4c1-e1be-4d25-bdd3-9d4aae219465', '1998/9/22の日記', 'うっそ、factoryが終わる？ sky!perfecTVに移動？うわー、嫌だなあ。スカパー契約しようかなあ。って多分しないけど。 ', '1998-09-22 14:59:59+00', '1998-09-22 14:59:59+00');
INSERT INTO blogpost VALUES ('b4cd5b0c-3d48-4a2f-ae22-919d754dbef0', 'MSH - The next Windows Command Shell', '(draft)

http://channel9.msdn.com/wiki/default.aspx/Channel9.MSHWiki

', '2005-03-18 01:59:24+00', '2005-03-18 01:59:24+00');
INSERT INTO blogpost VALUES ('282e0f23-051b-4e5c-97d0-a797e4539bd7', 'そうか、メタ記事にするといいのか。', 'いや、以前「.NET系のエントリでブックマークされるには？」ということを考えたのですが、404 Blog Not Foundのエントリを読んで考え直しました。リンク集とかまとめサイトとかにすればブクマ率が上がるかもしれない。確かに。

このエントリは個人的なメモにつき、リンクは無し。', '2007-02-27 09:01:49+00', '2007-02-27 09:01:49+00');
INSERT INTO blogpost VALUES ('4f7692db-e795-4769-90a1-51211af17f34', '予防接種', '生後二か月たったので予防接種を受ける。

豊洲近辺はなかなか予約が取れないらしく、妻実家そばの小児科で受けることになった。

注射で大泣きして大変かと思ったが、数分後には泣き止んでいた。

なんだ、強い子だなと思ったが、その後一日中ぐずっていたらしい。そりゃそうだよな。不快だよなあ。', '2014-12-28 08:57:38+00', '2014-12-28 08:57:38+00');
INSERT INTO blogpost VALUES ('751df7af-a118-481b-b16c-8c2253126f4d', 'FlashでBlog', 'blog.30k2.comというサイトはBlogのフロントエンドにFlashを使っている。

どこかのサイトに「FlashなBlogってないですか？」みたいな問いかけがあったように思ったのだが、問いかけを見ているときにはblog.30k2.comを思い出せず、blog.30k2.comを思い出したときには問いかけのあったサイトのことを忘れている始末。

', '2004-03-09 11:40:28+00', '2004-03-09 11:40:28+00');
INSERT INTO blogpost VALUES ('eaef9f20-d79d-492f-940b-8f3cfe27fd7b', 'Audrey Tang', 'read this entry posted by Audrey Tang.

what if we called her "o-tori tan" (鳳たん) ? ...... hey, to whom the hell am I offering a suggestion? ;-)', '2006-03-30 03:57:26+00', '2006-03-30 03:57:26+00');
INSERT INTO blogpost VALUES ('635a96f6-09f2-4614-a4fd-eec8b72f54fa', '一二功夫', '「イー・アル・カンフー」のテーマソングを、中国の伝統楽器(胡弓とか)で演奏したものが聞きたい。

生演奏がいいけど、難しいなら打ち込みでもいいや。

えーと、仕事してないときはこういうことばっかり考えています。', '2007-04-18 09:24:10+00', '2007-04-18 09:24:10+00');
INSERT INTO blogpost VALUES ('904f1bcb-4b9f-4442-8f69-c07fcb655521', '姉の結婚式', 'ICUの大学礼拝堂にて。いつも思うことだけれど、やたら広くてやたら緑の多い敷地だ。

前回来たときは友人の記念会(いわゆる「一周忌」だが、友人はクリスチャンなのであった)でシーベリー記念礼拝堂【写真】を使ったのだが、今回はもっと大きな大学礼拝堂【写真】で挙式。ちょっとだけ故人を偲んだ後、気持ちをお祝いモードに切り替える。

立派な礼拝堂で、立派な式だった。女性牧師さんの礼拝説教も分かりやすくて良かった。親父が姉貴のドレスの裾を踏まなければ完璧だった……いやむしろ笑い的には踏んだ方が完璧か。

披露パーティは、ICUのアラムナイハウス(学士会館)【写真】にて。パーティーは手作りでアットホームな宴だった。

スライドショーが結構長めだったが、その途中でパリ在住の友人とビデオチャット！なんていうイベントも飛び出した。後で聞くとFOMAによるインターネット接続を2系統使った結構な離れ業だったようだ。すごいよ！イシカワさん！

主役の二人も準備に追われて大変だったことでしょう。おめでとうございます＆お疲れさま。安心して新婚旅行に行ってきてください。

二次会は吉祥寺のライブハウスにて。親族および故郷の友人はパーティー後に帰っていったため、事実上ICUの同窓会。おれは隅っこで大人しく飲んでいた。相手してくれたみなさまありがとうございました。

会場には、おれがWebサイトをよく読んでいるあの人やあの人やあの人やあの人なんかもいらっしゃっておりヒデキ感激。挨拶できた人もいればできなかった人もいるのだけれど。
', '2004-09-20 06:52:08+00', '2004-09-20 06:52:08+00');
INSERT INTO blogpost VALUES ('65f06998-a17a-4a4d-bc03-fb6a69ceb073', 'アクセスログ', 'RSS/ATOMのアクセスログも見たいんだけど、ロリポブログでは無理ぽ。', '2008-06-02 10:05:55+00', '2008-06-02 10:05:55+00');
INSERT INTO blogpost VALUES ('f5b02907-cf3b-404b-a91f-628b57cb8918', 'ダケジャナイテイジーン', '「ダケジャナイテイジーン」の女の子(Manon Gaurin)が何気に可愛いと言い張っている。しかし、妻は批判的。

最近成長してきたことについては合意している。', '2007-08-30 14:33:19+00', '2007-08-30 14:33:19+00');
INSERT INTO blogpost VALUES ('815a5dc6-a70b-4146-8eb7-4439bf4f1693', 'Web承認ワークフロー用スターターキット', 'ASP.NETとWindows Workflow Foundationを用いたスターターキットが公開されました。

スターターキットはVisual Studio 2005のプロジェクトになっています。利用するには、Visual Studio 2005に加えて、.NET Framework 3.0、Windows Workflow Foundation用の VS2005拡張、そして SQL Server 2005 Express以降が必要です。

業務モデルは小規模な会社の承認業務で、作成、承認、確認の3つのロールが組み込まれているそうですよ。', '2007-04-12 01:10:38+00', '2007-04-12 01:10:38+00');
INSERT INTO blogpost VALUES ('ea16bb9e-4c8c-4841-9409-028fa18f56a5', 'System.Net.Mail.SmtpClient と Quoted Printable', '.NET Framework 2.0のSystem.Net.Mail.SmtpClientクラスでメール送信を試してみていますが、本文がquoted printableエンコードされてしまいます。

一行は76バイト以下だし、メールヘッダに"content-transfer-encoding: 7bit"を追加したりしていますが、どうにも回避できません……

(追記)菊池さんがβ2の実装を推測しています。上では書き忘れていましたが、猪股が試しているのもβ2 (日本語) なのでした。

(追記)小川さんが回避策を提示しています。', '2005-10-07 06:37:37+00', '2005-10-07 06:37:37+00');
INSERT INTO blogpost VALUES ('1bf420ab-72d9-4ce7-b7df-c4e34ba533f7', '1998/7/23の日記', '泉くんの新居へ行った。肉をもりもり喰った。うまかった。ところで、友人の妹ってのはどうして良く見えるのだろうか？兄貴の友人が来たら猫を被るんだろうか？妙に気を使ってくれたりして、変な感じ。', '1998-07-23 14:59:59+00', '1998-07-23 14:59:59+00');
INSERT INTO blogpost VALUES ('6a032f46-b893-4fc5-bdf0-56e7c857b2ef', '1998/7/8の日記', '近田春夫「考えるヒット」立ち読み。 Every Little Thingのページの安斎肇さんのイラストがむっちゃツボにはまった。やっぱあの人はすげぇ。', '1998-07-08 14:59:59+00', '1998-07-08 14:59:59+00');
INSERT INTO blogpost VALUES ('cd6a0cb7-f4e7-41c8-950f-46847332a751', 'マーチン・ファウラーのGUIアーキテクチャ', 'これです。PofEAA2とかEAA-Devとか言われる、"Development of Further Patterns of Enterprise Application Architecture"に関係するもの。

「フォームとコントロール」「MVC」「VisualWorksのアプリケーションモデル」「MVP」を解説していて、これはWebAppのMVC(といわれているもの)を考える上でも、RIAを考える上でも、Composite UIを調べる上でもかなり重要だと思う。

ざっくり翻訳してみた(藤原くんありがとう)ので、公開許可でも取るか……', '2008-09-05 01:08:09+00', '2008-09-05 01:08:09+00');
INSERT INTO blogpost VALUES ('2e93df40-95f3-4aea-8dd6-71816a9d9f75', 'メディアテクノロジーラボ++', '地球で旅行検索 : Microsoft Virtual Earth 3D x エイビーロード WEBサービス デモサイトを公開

REMIX ''07でいちばん感心したのはこの「Virtual Earth x AB-ROAD マッシュアップ」でした！

「プラグインのインストールが必要」と言いながら、実際にはVirtual Earth 3Dのexeそのものもインストールしなきゃいけない。プラグインだけが必要なのかと思っていたのでちょっとがっかり。結局外部exeをホストするようなプラグインなわけで、それならGoogle Earthもブラウザでホストできるはずだね。Google社がそんなActiveX(やNetscape Plugin)を作るかどうかはともかく。', '2007-09-20 01:17:17+00', '2007-09-20 01:17:17+00');
INSERT INTO blogpost VALUES ('a56699bd-deda-4a4c-a574-3a7873593352', 'ReSharper', '(追記)上記↑タイトル横の「resharper」カテゴリをクリックすると関連記事が表示されます。

ReSharperは、JetBrains社のC#開発環境です。

JetBrains社は、IntelliJ IDEA(以下、IDEA)というJavaの開発環境を販売している会社。

その会社が作った、IDEAのC#版と目される開発環境がReSharperなわけです。

現在はEAP版が公開されています。

IntelliJ Technology Networkのフォーラムに投稿がありました。

投稿についた返信にある通り、EAP用サイトに指定されたアカウント(eapuser/eapuser)でログインしましょう。

これから、少しテストしてみて感想を載せたいと思います。

……と思ったんですが、TheServerSide.netにエントリがあるのを発見。

(追記)ReSharperの使用レポートを日本語に訳しています。', '2004-02-18 05:47:21+00', '2004-02-18 05:47:21+00');
INSERT INTO blogpost VALUES ('5b2d4251-fcae-4783-af14-b5c96f25dd2a', '戦わないプログラマ＠はてな', 'leptonさんがはてなダイアリーに。memo.', '2008-04-07 01:17:50+00', '2008-04-07 01:17:50+00');
INSERT INTO blogpost VALUES ('8b712a69-64cd-40d4-a347-76509e113cf9', '正規表現', 'デフォルトでは文字"."は改行文字にマッチしない。

改行文字にマッチさせたいときはsオプションが必要なのだそうだ。

実は知らなかった。

正規表現は「バッドノウハウ」ではないのだろうけれど、複雑な正規表現を書くのが喜びだという人は「奥が深い症候群」に近いところにいると思った。', '2003-08-21 10:01:56+00', '2003-08-21 10:01:56+00');
INSERT INTO blogpost VALUES ('41e67ed2-0bd3-40b7-8e5d-0503788a1d7a', 'Session State Partitioning', 'どっとねっとふぁんBlogのエントリを見て、MSDN Magazineを見に行ったら、Fast, Scalable, and Secure Session State Management for Your Web Applicationsという記事が。

これはいいですね。実際的だと思います。

特に、ASP.NET 2.0のSession Stateパーティショニング機能に興味を持ちました。セッションIDをキーにして、利用するステートサーバを振り分ける機能のようです。地味なんだけどおもしろいです。', '2005-08-11 05:55:18+00', '2005-08-11 05:55:18+00');
INSERT INTO blogpost VALUES ('40a3f156-fec4-4c46-96e1-e722d92ce7f0', '地元にて', '友人の墓参りに行ったらご両親とばったり。

それはもう笑ってしまうくらいのタイミング。

その後お宅にお邪魔してきた。

ということで今年のテーマは「偶然の出会い」。', '2002-01-02 14:59:59+00', '2002-01-02 14:59:59+00');
INSERT INTO blogpost VALUES ('569d91ec-a04c-4a0a-bac4-a03cd172c060', '1998/9/16の日記', 'モーニング「バガボンド」はかっこいい！やっぱモーニング最高！個人的には「えの素」が好きなんだけど… ', '1998-09-16 14:59:59+00', '1998-09-16 14:59:59+00');
INSERT INTO blogpost VALUES ('36bc3e13-4d87-4a23-b397-9c3cdbed29e7', '昔', '「C言語は関数型である。なぜならサブルーチンがなく、すべてが関数だから」という珍説を読んだことがあったけど、あれってなんだったんだ?7DAYS。', '2007-11-28 02:08:16+00', '2007-11-28 02:08:16+00');
INSERT INTO blogpost VALUES ('12297f58-cff3-4156-b919-e080dec14db7', 'フリーセル', '携帯アプリでフリーセルをやっているのだが、どうにも解けない問題がある。悔しいのでコンピュータに解かせようと考えた。いい練習なので自分で書いて実行してみた。

そしたら。2分ほど考え込み、得意げに(?)出してきた手順が2万ステップ弱。

アホなロジックにしたのは俺なんだけど、つい笑ってしまった。', '2007-07-04 01:58:49+00', '2007-07-04 01:58:49+00');
INSERT INTO blogpost VALUES ('a9d9ed2c-113d-4219-8b96-044a0112457a', 'C#: 昨日、今日、明日: アンダース ヘルスバーグへのインタビュー Part 1', '移動しました', '2005-12-21 08:27:42+00', '2005-12-21 08:27:42+00');
INSERT INTO blogpost VALUES ('209c2025-a910-4e14-925d-2fb2e31dcf1b', 'Earth, Wind & Fire', '「ウィンドウ」ではなく「ウィンド」が一般的だと思った。

ところで、おならファイアーのことを最初に「アス・ウィンド＆ファイアー」(Ass, Wind & Fire)と言った奴はすごい。', '2007-10-03 16:04:12+00', '2007-10-03 16:04:12+00');
INSERT INTO blogpost VALUES ('b60ffd34-c20c-45b7-a68d-cd8d6924e116', 'あんたにあげた愛の日々を', 'エレカシの宮本浩次に、いつか「あんたのバラード」をカバーしてほしい。', '2000-06-06 14:59:59+00', '2000-06-06 14:59:59+00');
INSERT INTO blogpost VALUES ('30e6e004-5e2c-486a-944d-959803569711', 'ExcelCreator .NET', 'アドバンスソフトウェア株式会社のExcel Creator .NET。

有償Excelツール。JavaならJakarta POIとかもあるけど。英語ソフトなら選択肢はもっと広がるけど。国内で売っている類似ソフトってないものか。

.NET Managineに載ったプロダクト紹介(PDF)', '2005-06-13 06:40:42+00', '2005-06-13 06:40:42+00');
INSERT INTO blogpost VALUES ('522ac676-5c95-4b86-bde4-d3913426917d', 'テレビが壊れた。', 'テレビを見ていた。

急に「ぷちゅん」という変な音がして、テレビの表示画面が狭くなった。ピントもボケた。

ほっといたら「ぷいん」という音がして、完全に画面が真っ黒になってしまった。

これはまずい。すぐにリモコンで電源を切り、しばらく考えた後で本体電源も切った。

直後、テレビからいや～な臭いが…

南～無～', '2001-07-27 14:59:59+00', '2001-07-27 14:59:59+00');
INSERT INTO blogpost VALUES ('95776874-ca2b-459e-b264-e2a88a766dfc', 'MS Conference 2005おもしろそう', 'http://www.event-registration.jp/events/msc05/keynote.htm

“あの"Steve Ballmerと、Visual BasicのチーフアーキテクトPaul Vickが来るようなので。', '2005-10-19 09:51:08+00', '2005-10-19 09:51:08+00');
INSERT INTO blogpost VALUES ('c181b57a-d7e9-4fa5-8a7a-c9bf12e8f14f', 'ハチクロ', 'ハチクロとミツーバー。（三つ葉！？）

えーと、仕事してないときはこういうことばっかり考えています。', '2008-05-05 21:27:45+00', '2008-05-05 21:27:45+00');
INSERT INTO blogpost VALUES ('68832823-1307-495a-ae3d-7b26fcc23191', '友人のライブと外山恒一', '新中野のライブハウスに行ってきた。

帰りに新宿駅で降りたのだが、そのときに外山恒一氏と思しき人を見た。話しかけたりしなかったので本人かどうかは分からないけどね。

ライブはこんな感じ。携帯電話で撮ったから何がなんだか分からないかもしれない。だが、それがいい。

http://inomata.lolipop.jp/images/MAV_0002.3G2

http://inomata.lolipop.jp/images/MAV_0003.3G2
', '2007-05-06 03:22:03+00', '2007-05-06 03:22:03+00');
INSERT INTO blogpost VALUES ('beb63e67-e4f1-4184-ac4c-037dcabdc60f', 'AFOK', 'ライブ行ってきました。ペンパルズ。浮世の憂さが全部飛んで行った。気持ち良かった！

12月には一緒にBLITZ行こうか、かずくん。', '2000-10-01 14:59:59+00', '2000-10-01 14:59:59+00');
INSERT INTO blogpost VALUES ('802a1a96-7d59-4bff-ac77-c4b3dbdff25e', 'first post:開設しました', 'エキサイトブログから移転してみました。

いろいろテストします。

文字コードはEUCなので、トラックバックが文字化けしないか心配です。

トラックバックのテストをしてみます。

（追記）やっぱりEUCで送信されるようです。これはたぶんまずい。

（追記）charsetをUTF-8に変更してみました。どうかな？', '2004-01-31 15:00:00+00', '2004-01-31 15:00:00+00');
INSERT INTO blogpost VALUES ('a266d121-855d-4dba-be34-248c8e8a4395', '十面鬼ゴルゴスが欲しかったのだが……', '童心に返ってみんなでガシャポン。

「あのぉ、ガシャポンしたいんでぇ、両替をお願いしたいんですけどぉ」

「あのぉ、お金を入れて回したのにぃ、出てこないんですけどぉ」

めっちゃおもろいんですけど。何やってんだ25歳。', '2000-11-23 14:59:59+00', '2000-11-23 14:59:59+00');
INSERT INTO blogpost VALUES ('b1ce3899-d6d7-4901-b1ef-10f4f4402f9a', 'OracleでWindows認証', 'Oracle9i：NT/2000のネイティブ認証

「Windows認証はSQL Serverだけ」なんて嘘は言わないように気をつけなければ。

', '2004-10-22 02:38:47+00', '2004-10-22 02:38:47+00');
INSERT INTO blogpost VALUES ('197bd3b5-1ba9-49d0-a804-19e3ad17a8fe', 'possibility', '2.26事変の予感。', '2014-02-26 15:03:56+00', '2014-02-26 15:03:56+00');
INSERT INTO blogpost VALUES ('276c362a-e3bd-4e5e-993e-77da8eb5f4e2', 'Office 2003をWiki Clientに Part 2', '明確にページを意識できるものとなると、ExcelかPowerPointだろう。

Excelならシート、PowerPointはスライドが使えそうだ。

行数の自由度を考えてExcelをWikiクライアントにしようと思った。

しかし、落とし穴があった。Excelだとハイパーリンクはセルの属性なのだ。

1つのセルをWikiの1行に対応させるとなると、1行に複数のリンクを設定するのが難しい。

しばらく悩んで、ハイパーリンクによる実装をあきらめる。

そのかわりにカスタムメニューを追加しよう。

ユーザがメニューを選択したらアクティブなセルに含まれるリンクを全部抜き出してドロップダウンリストを表示し、

そこからユーザに選んでもらうというインターフェースはどうだろうか。

いずれにせよ、VBA、そしてExcelのオブジェクトモデルに関する知識が必要だ……

', '2004-08-26 12:41:32+00', '2004-08-26 12:41:32+00');
INSERT INTO blogpost VALUES ('6d530f38-b3e7-4270-b88f-62766d3d6888', '1998/6/23の日記', '田代のお父さんが仕事で東京へやって来た。 3人で御飯を食べた。ビールをがぶがぶ飲んで3人とも酔っ払って寝た。おもしろかった。ご馳走様でした。

三代目魚武濱田成夫と大塚寧々が結婚。玉名で記者会見。', '1998-06-23 14:59:59+00', '1998-06-23 14:59:59+00');
INSERT INTO blogpost VALUES ('c6e7d5b8-e059-43e9-82fe-c80ee4820932', 'Ricksonがヒクソン、Royceがホイス、Ronaldoがホナウドならば→', 'ホベウト本郷', '2008-02-19 00:48:11+00', '2008-02-19 00:48:11+00');
INSERT INTO blogpost VALUES ('0eaebe1a-879f-4c0f-9b0c-5b978b7e7ec6', 'ウサギ2', '冗談のはずがパチスロで勝ってしまい、ウサギを飼うことに。

「飼うならピーターラビットみたいなのがいいなあ。」そうと決まれば下調べ。正月もあけない2000年の1月3日、行動を開始した。

近所のペットショップにもウサギはいたが、もっとたくさんの中から選びたいと思い、あちこちのペットショップに電話をかけまくった。ペットショップだけじゃなくて、里親を募集しているWebサイトも見た。そんな中、大塚のペットショップに電話したら、ウサギが10匹近くいるというので、rolioと2人で向かった。

ちょっと狭くて暗めのそこには確かにウサギがたくさんいた。ピーターラビットっぽいのもいた。ブサイクなのもいた。面白かったのが、白い色に黒斑のウサギ兄弟。彼らはみな目の周りに隈取のような模様があったのだ。「ははは、こいつら歌舞伎みたいだなあ。」と笑い飛ばした後、お目当てのピーターラビットみたいなのを抱いてみる。うん、かわいい。かわいいんだけれど…

心のどこかに引っかかるものが。そうだ、あいつらだ。あの歌舞伎ウサギ。好みとはぜんぜん違うウサギのくせに、何か心に訴えかけてくるものがある。おかしいな。かわいくないのに。かわいくないのに。

ちっくしょー、お前を連れて帰らなかったら、きっと後悔する！

運命的な出会いというのは、こういうことなのだろうか。3匹の歌舞伎兄弟の中で一番元気そうで人なつっこそうなのを選び、家につれて帰った。', '2005-05-15 11:49:49+00', '2005-05-15 11:49:49+00');
INSERT INTO blogpost VALUES ('ffc9f135-4712-4d44-a5c4-ae8c1ec74a18', '31日間ReSharper一周', '移動しました', '2007-04-26 08:13:56+00', '2007-04-26 08:13:56+00');
INSERT INTO blogpost VALUES ('eb27a563-6b06-40a8-864d-e2caf4eb3c88', 'シンガポールその4', '晩飯にはラッフルズのエンパイアカフェでラクサを食べた。うまかった。

でも、それがいけなかった。

アサリのような貝が入っていたのだが、一つ食べてみて「これ生じゃないか？」

とりあえず口から出した。で、食べないのはもったいないので貝だけ除けて食べたのだが、その後ズキューーーーン！

シンガポールスリング？呑んでる場合じゃないっつーの！', '2007-06-02 18:15:06+00', '2007-06-02 18:15:06+00');
INSERT INTO blogpost VALUES ('a963f29d-9413-4184-93cb-6fdb9d58fa58', 'クリームシチュー', '玉ねぎ、にんじん、じゃがいも、鶏もも肉、しめじ、白菜を炒めてコンソメで煮る。

小麦粉を炒めて牛乳で少しずつ伸ばしホワイトソースをつくる。

ホワイトソースを加えて煮立て、とろとろになったら完成。

余った白菜としめじは煮浸しに。', '2008-01-15 14:07:02+00', '2008-01-15 14:07:02+00');
INSERT INTO blogpost VALUES ('b1e70035-192c-4e61-a1e2-47a68d1a1222', 'λ計算のチャーチとカリー化のカリーのトリビア', 'チャーチの息子はカリーの娘とデートしたことがある

きっと副作用はなかったんだろう', '2007-08-27 12:51:05+00', '2007-08-27 12:51:05+00');
INSERT INTO blogpost VALUES ('9f629a35-e333-4a2b-a4cf-9c11f124218d', '明日まで暇じゃ。', '妻はテニス合宿に出かけて、明日まで帰らんけえの

近所の野良猫をねこじゃらしでからかったら

いい猫パンチをみせよったぞ

地味じゃが、翻訳でもするかの

じゃあの。

"OOPSLA school"は、「OOPSLA派」がいいじゃろうか

それとも「OOPSLA学派」がいいじゃろうか

わしは「OOPSLA流」も好きじゃ

「OOPSLA式だよ派」はふざけすぎじゃの

じゃあの。', '2007-10-13 02:25:53+00', '2007-10-13 02:25:53+00');
INSERT INTO blogpost VALUES ('52d5d1a4-715e-4b24-bcf2-51a118a90188', 'Visual Studio Hacks', '(オレンジニュース経由)

O''ReillyのHacksシリーズに新刊が。これいいなあ。VS.NETはいろんなカスタマイズが可能だったり、いろんなアドインを作れたり、あるいはデザイン時サポートなんて機能もあったりする*んだけど、いまいち使いこなせていない。そんなときにこの本があるといいだろうな。欲しいなあ。

(追記)デザイン時サポートはVS.NETだけで使う機能ではない。コメント参照のこと。', '2005-03-25 04:01:24+00', '2005-03-25 04:01:24+00');
INSERT INTO blogpost VALUES ('575373fe-107c-4101-8043-a07fbd202697', 'Application Architecture for .NET', '.NET のアプリケーション アーキテクチャ : アプリケーションとサービスの設計

やっと公式翻訳が出ました。

@ITの連載が完結した矢先でした。

たくさんの人が読むことを期待します。

', '2004-02-15 17:41:15+00', '2004-02-15 17:41:15+00');
INSERT INTO blogpost VALUES ('fb6009a0-5e6c-4226-9c77-3a9bc90a92aa', '.NET関連メモ', 'A Grouping and Subtotaling Repeater for ASP.NET

Microsoft ACT standalone installation ', '2005-09-18 06:29:16+00', '2005-09-18 06:29:16+00');
INSERT INTO blogpost VALUES ('3bacfb89-ba1c-467c-b7a9-ef7f699ec905', 'Hejlsbergへのインタビュー記事(英語)', 'C#: Yesterday, Today, and Tomorrow: An Interview with Anders Hejlsberg, Part 1

C#: Yesterday, Today, and Tomorrow: An Interview with Anders Hejlsberg, Part 2

ヘジたん(MSKKは「アンダース ヘルスバーグ」と表記しているし、音もそっちのほうが近いのだろうが)のインタビュー。O''reillyに許可取って翻訳したら喜ばれるでしょうか？', '2005-11-28 04:39:34+00', '2005-11-28 04:39:34+00');
INSERT INTO blogpost VALUES ('596743d1-d1e0-47b1-a6d3-928dffd96f09', '菅平虫 = ブヨ', '先週末、菅平にテニスしに行ってきた。人生3回目のテニスなので、お話にもならないレベルだ。でも本題はテニスではない。

同行した人たち曰く「菅平には『菅平虫』略して『平虫(だいらむし)』がいる。」よく話を聞くと、ブヨのことらしい。菅平にはブヨがたくさんいて、よく誰かが足を刺されてしまう。足を刺されると腫れてかなり痛いのだとか。

実際、刺された人は今回もいた。菅平に行く際は虫除けスプレーを持っていくといい。', '2007-07-31 06:37:44+00', '2007-07-31 06:37:44+00');
INSERT INTO blogpost VALUES ('d9479e9b-48f2-45f7-9db5-658086abd952', '1998/9/20の日記', '最近書き忘れが多い。岩下君の家に行った時、みんなで「ウォレス＆グルミット」を観たのを忘れてた。これはすごく良くできた、面白い、そしてかわいい作品だった。ビデオレンタルショップにあったら是非借りるべし。おすすめ。

内田有紀が映画の撮影が終わってメディアに復帰してきたらしく、最近よく見かける。こないだ見た時はCDシングルのCMだった。お、なんかかっこいいな、と思ったら、プロデュースがI.N.A. (hideの右腕)だった。なるほど。', '1998-09-20 14:59:59+00', '1998-09-20 14:59:59+00');
INSERT INTO blogpost VALUES ('4fe736a0-af0b-42d2-981e-0bf62bbdda35', 'あいまいな用語と私', '企業情報システム開発にはびこるあいまい語。その1: 「メッセージ管理」

「メッセージ」もあいまいなら、「管理」もあいまい。何とかしてくれ。

OOのメッセージパッシングでも、EAIのメッセージ交換でも、MQのメッセージングでもなかったりする。

よく聞いてみると、「企業情報システムが表示する(警告、注意、問い合わせ、情報などの)メッセージの一貫性が取れていないとエンドユーザが混乱するので、メッセージの文言を管理し、場当たり的なメッセージを表示しないようにする」ということだったりする。

それ自体は大事なことなんだけどね……', '2007-07-11 03:14:16+00', '2007-07-11 03:14:16+00');
INSERT INTO blogpost VALUES ('a1b2b5c8-bbbf-4833-8cc3-052b2549c732', '3rd p.c.', '10w.
気分は落ち着いてきたらしい。', '2014-04-12 04:26:52+00', '2014-04-12 04:26:52+00');
INSERT INTO blogpost VALUES ('7b7c2900-6c26-4f5f-be9c-ec8d4a0cd1ec', 'Made In Japan', 'MIJSのイベントではV6に歌を歌ってもらえばいいと思うよ。', '2007-09-14 02:10:12+00', '2007-09-14 02:10:12+00');
INSERT INTO blogpost VALUES ('3d726503-81b2-4f9a-9269-a6b70da1c5fa', '1998/4/6の日記', 'ラコステの遠藤久美子、最高！！！！！ ', '1998-04-06 14:59:59+00', '1998-04-06 14:59:59+00');
INSERT INTO blogpost VALUES ('9b7afd00-019e-4577-acaf-b1d2a94faa44', 'Silverlightに3Dゲーム"Quake"を移植中', 'QuakeLight, the Silverlight port of Quake, is coming...

ほほう。
しかし、Flashみたいに環境が整備されているわけじゃないので、ハードルは高そうだ。
ちなみにFlashの環境の話は、「C 言語で書かれたソフトウェアが Flash で動くようになるかもしれない | METAREAL」とか、LL Future 「古い言語、新しい言語」におけるalohakunの発表資料(ppt)とかを参照のこと。', '2008-10-24 01:24:36+00', '2008-10-24 01:24:36+00');
INSERT INTO blogpost VALUES ('4241ae97-962e-4b1b-b6b7-f839b68bca74', '1998/7/29の日記', '家に帰ってすぐ寝ようか…と思っていた時、 三浦から電話。だらだら喋っていたら4時間以上電話してしまった。しかも内容は「マーク・パンサーの人生について」とか、どーでも良いような内容。でも面白かった。', '1998-07-29 14:59:59+00', '1998-07-29 14:59:59+00');
INSERT INTO blogpost VALUES ('a8d4836b-bee6-4fc4-b149-013edbe9c5b3', '妻がNationalナノケアのモニターに選ばれた', 'モニター対象者は「アジアのきれいなおねえさん」メンバーとなるらしい。

ネタのような話。でもまあ喜ばしい、の、かな、たぶん、きっと。', '2007-08-27 12:45:49+00', '2007-08-27 12:45:49+00');
INSERT INTO blogpost VALUES ('a215ed2c-f42c-47bd-bce5-2f8cbb4173fd', 'アメリカに引っ越します', '会社の米国子会社に数年駐在するというポストの募集を最初にしてたのが4月ぐらい。その時はあまり行く気もなく（ソフトウェアエンジニアとしてのロールではないので）妻に軽く話を振ってみた程度。ただ、妻は応援してくれる（というか自分も一緒に行きたがる）ということはわかった。

それから2か月強過ぎ、同じポストが再度募集していた。正直なところ現在の職務・部署でやりたいことがだんだん見つからなくなってきていたので、とりあえず手を挙げてみようと思った。ロールやミッションの詳細は何もわからなかったが、おそらく面談があるんだろうしその時に聞いてからもう一度考えようと思ったのだった。で、上司に伝えたのが6月末。

結果は数日後に出た。おまえに決定した、と。面談はなかった。しいて言えば決定の数時間前、「自動車免許は持っているか？」と聞かれ、はいと答えたぐらい。あまりにもあっけなく決まったため、悩む暇もなかった。とはいえ行く気にはなっていたのでそこであえて断る理由もなかった。

そして言われた。米国の就労ビザを取得するのに2か月はかかるが、ビザが下りたら9月には赴任してもらいたい、と。

実際にはそんなにスムーズには物事が進まなかった。はじめに米国子会社側でビザ申請書類を作るのだが、そこにかなりの時間がかかったためだ。それには理由がある。4月の時点では別の人が選ばれていたのだが、その人のビザ申請は却下されてしまったのだ。その結果として自分に話が回ってきたのではあったが、そのようなことがあったため、弁護士が慎重に慎重を期して丁寧な出願書類を作ったらしい。結局、米国での申請書類が日本に届いたのは10月頭だった。しかしビザを得るためにはその書類を持って日本の米国大使館に行き、口頭でのインタビューを受けなければならない。結局、インタビューの日程は10月21日となった。そして今日、10分程度のインタビューを受け、なんとかビザが下りることが確定したのだった。

ビザの書類が届くのはここからさらに1週間程度後であり、それを受け取って初めて残りの渡米手続きを進められる。社内手続きや、航空券の手配などだ。しかしスムーズに進めば来月の頭には渡米できるはずだ。

当初は単身での渡米であり、家族を呼ぶのは来年1月か2月あたりになる。それまでにアパートを契約し、生活基盤を整えなければならない。もちろん仕事もある。しかし自分の現在の英語力は旅行者レベル、貧弱なものでしかない。最初にやるべきことは英語力の向上だろう。しかし自分はあまり心配していない。まあ、きっとなんとかなるだろう。', '2016-10-21 04:42:06+00', '2016-10-21 04:42:06+00');
INSERT INTO blogpost VALUES ('896a2385-2bf9-448f-9c69-d408bf1a2b14', '1998/6/4の日記', '昨晩、遠藤久美子の番組を観た。大槻ケンヂがゲストで出ていて、エンクミにパンク（っつーかハードコア）を教えていた。エンクミが精一杯の恐い顔(でも恐くない)で登場し、「ワンツッスリッフォッ、てんぷら！てんぷら！てんぷら！お前だ！」と叫ぶ姿はめちゃめちゃ面白かった。 ', '1998-06-04 14:59:59+00', '1998-06-04 14:59:59+00');
INSERT INTO blogpost VALUES ('e5e68dba-eee3-40db-b1b6-6a7aeffe1be8', 'Tuscanyの読み', 'Apache Tuscanyは英語だから確かにタスカニーなんだろうけど、個人的にはトスカーナと読みたい。', '2007-09-26 10:12:45+00', '2007-09-26 10:12:45+00');
INSERT INTO blogpost VALUES ('06d9e2a5-c0bf-4b10-a280-e4222ed035ce', '8th p.c.', '順調なので診察も速い。なにより。
そろそろ色々買ったり準備したりしないといけないな。
名前も考えなければ、ということで画数ベースの候補をいくつかピックアップしたり。', '2014-08-15 01:18:57+00', '2014-08-15 01:18:57+00');
INSERT INTO blogpost VALUES ('a17c5631-982b-4981-9440-d7955b028123', '2nd p.c.', 'w7.', '2014-03-22 02:47:08+00', '2014-03-22 02:47:08+00');
INSERT INTO blogpost VALUES ('288155b2-3956-46ce-b5d9-10d142a39ddb', 'Fleverlight勉強会 vol.2 行きたいな', 'ほぼタイトルがすべてですが、11/22の土曜日に大阪でFleverlight勉強会 vol.2が開催されるので、行ってみたいなと。', '2008-11-05 11:37:47+00', '2008-11-05 11:37:47+00');
INSERT INTO blogpost VALUES ('a2475eda-9c00-45e1-a325-b5dbd85f9186', '検査の結果問題なし', '別のクリニックで検査してもらった。

肺動脈が細いのと異常腱索があるので、心拍が早いと雑音が出るが、肺動脈は成長すれば問題なくなるし、腱索は機能上は特に問題ないので普通に過ごして良いとのこと。

安心して、ランチ食べて帰る。', '2015-05-15 03:49:57+00', '2015-05-15 03:49:57+00');
INSERT INTO blogpost VALUES ('635af8fa-b613-4d31-ae59-a0f96400c387', '続: System.Net.Mail.SmtpClient と Quoted Printable', '.NET Framework 2.0のSystem.Net.Mail.SmtpClientクラスでメール送信を試してみていますが、件名が勝手にQエンコードされてしまいます。
日本語メールなら普通Bエンコードだろー。

と文句をたれつつも、回避策はあって、MailMessage.SubjectEncodingプロパティはNothingにしておき、自前でBエンコードした文字列をSubjectプロパティにセットしてやればよろしい。', '2006-10-21 16:11:31+00', '2006-10-21 16:11:31+00');
INSERT INTO blogpost VALUES ('04ba73ec-edf7-40c0-9d48-1890efc6effa', '1998/5/25の日記', '古い邦画のタイトルって面白くてかっこいい。「若くて悪くて凄いこいつら」！うはー、凄いセンス！', '1998-05-25 14:59:59+00', '1998-05-25 14:59:59+00');
INSERT INTO blogpost VALUES ('5135f068-6579-4dfe-8968-45f74e010602', 'Fleverlight', 'Silverlightを囲む会 in大阪#3 & Flex3 勉強会 第46回＠大阪

もっと早く知っていれば調整して大阪に向かったのだけれど。あーあー、行きたかったな。', '2008-07-26 09:19:14+00', '2008-07-26 09:19:14+00');
INSERT INTO blogpost VALUES ('2e4bdfd0-b3f6-4d09-badf-4d0e5000b8c8', 'Longhorn情報（日本語）', 'MSDN JapanにLonghorn Developer Centerが開設されました。

', '2004-02-18 05:05:54+00', '2004-02-18 05:05:54+00');
INSERT INTO blogpost VALUES ('d8249467-b2e8-4ccb-87b9-db48de104d6c', '実話', '僕は永田町のホームで見た。

ラ・クリマ・クリスティのフィギュアと思しき箱を抱えたゴスロリ娘と

その横で柱を相手に四股を踏んだり鉄砲稽古を打ったりしているおっさんの姿を。

おばあちゃん、東京は怖い街です…', '2001-08-20 14:59:59+00', '2001-08-20 14:59:59+00');
INSERT INTO blogpost VALUES ('b7327271-82b3-485d-9724-61cc8bdd85bb', '1998/3/26の日記', '気持ちを新たに、日記を再開しました。よろしく。 

鏡を見ると、自分の顔にほくろが増えているのを発見。これは猪股家の家系なんだよなあ。おそるべし、I-Blood。 

バイトを午前中休み、学校へ。院の入学手続きをする。親に連絡をしていなかったので、お金が銀行に入っていない。とりあえず入学料のみ払う。 

バイトの移動中にラジオで偶然聞いた、 Triceratopsの「Raspberry」が良かった。去年の夏の曲なので、ちょっと遅いけど。「ロケットに乗って」よりこっちの方が好き。うー、バンドでやりたい。 ', '1998-03-26 14:59:59+00', '1998-03-26 14:59:59+00');
INSERT INTO blogpost VALUES ('a5f7d908-5db2-4cf2-80a5-f3b6d11b3aad', '1998/5/29の日記', '勘弁して下さいよ。マジへこむっす。', '1998-05-29 14:59:59+00', '1998-05-29 14:59:59+00');
INSERT INTO blogpost VALUES ('d315af70-d31d-4e57-9c28-3e7a5f197b38', '大木ちゃん？', '仮面ライダー電王に大木ちゃんが出てた？

別人かなあ。どうかな。第15話、6分30秒あたりからなんだが……やっぱ違う人かな。', '2007-05-05 23:21:56+00', '2007-05-05 23:21:56+00');
INSERT INTO blogpost VALUES ('d167aedb-475d-474b-bef5-ceb0aa6aead8', 'すったて', 'いりごまと大葉と玉ねぎときゅうりと味噌。みじん切りにしてすりばちですって冷水で割って、そうめんつゆにする。

近所のダイエーにいったのに、みょうがが見つからなかったので、みょうがは無し。ちょっと寂しい。', '2007-08-26 05:13:54+00', '2007-08-26 05:13:54+00');
INSERT INTO blogpost VALUES ('a0611ddd-d87e-460c-a3f5-ea6e5d5e289a', 'TheServerSide Debates: Software Factories vs. MDA', 'TheServerSide Debates: Software Factories vs. MDA

この議論は興味深い。時間を作ってきちんと読んでみたい。

', '2005-01-05 06:34:10+00', '2005-01-05 06:34:10+00');
INSERT INTO blogpost VALUES ('575ffb0b-81a0-4237-950d-6996146e3b27', 'Visual Studio 2005 Team System', 'Windows Developerマガジンに、VSTSについて原稿を書きました。次号にVSTS Beta 2 日本語版が付録添付されるのに合わせてということです。

記事の内容は機能の簡単な紹介程度です。さてどのくらい赤が入るでしょうか……

', '2005-05-13 07:36:11+00', '2005-05-13 07:36:11+00');
INSERT INTO blogpost VALUES ('8397691b-579b-4108-b212-f8eacc1eaf6b', 'ロリポブログに移行', '今まではWordPressを設置していました。しかし、テンプレートを変えてみたりCSSを使ってレイアウトしてみたりすることがだんだん面倒になってきたので、ブログエンジンはアウトソースすることにしました。

いや、かなり変わるもんですね、気分が。

ブログ自身の見た目もそうなんですが、管理機能のUIが変わったのが大きいです。
', '2005-09-18 12:12:53+00', '2005-09-18 12:12:53+00');
INSERT INTO blogpost VALUES ('803b3ffa-7026-40b7-84a4-344da13b0930', '夏カレー', '挽き肉と夏野菜のカレー。

スパイスは、ターメリック、カイエンペッパー、パプリカ、クミン、フェネグリーク、ガラムマサラ。コリアンダーは切らしてた。

しょうが1個はすりおろし。にんにく5片は絞り器（マッシャー？ラーメン屋にあるやつ）で潰す。

野菜は玉ねぎ1玉、にがうり半本、人参半本、セロリ1本、オクラ5本、なす2本、ホールトマト1缶。なす以外は小さく切る。

挽き肉は合い挽き。カレー用の粗挽き。

味つけは塩メイン。ちょっとだけ醤油。スープの素などは使わなかった。

念入りに炒めて、水分が飛んできたらプレーンヨーグルトと水を加えて煮る。

なかなか美味しくできました。', '2006-09-08 11:11:59+00', '2006-09-08 11:11:59+00');
INSERT INTO blogpost VALUES ('41008ac0-86f9-48a7-8e85-532e1762b4b1', 'あほブレイクビート2', 'クイーン「Another one bites the dust」のリフをバックに、オリエンタルラジオの武勇伝

えーと、仕事してないときはこういうことばっかり考えています。', '2006-05-05 07:47:40+00', '2006-05-05 07:47:40+00');
INSERT INTO blogpost VALUES ('56293275-1aa5-466e-a81c-f9c2fdc14f7b', '4.5 p.c.?', '3で血をとったが、手違いで検査が足りてなかったことが4で分かった。
今日はそれとは別に、q検査。
反応した場合どうするのか、まだ答えは出ていないが。。', '2014-05-17 00:06:27+00', '2014-05-17 00:06:27+00');
INSERT INTO blogpost VALUES ('393ceb07-85fa-4f82-b705-60639d66eee3', '拡張ストアドプロシージャからCCWを使ってマネージコードを呼び出せない', 'ってことなのかな、このサポート情報の言わんとするところは。

惜しいな、これができたらSQL Server 2000のトリガでマネージコードを呼べたかもしれないのに…

（マネージコードでなければ呼び出せるのだろうが、VC++でコードを書きたくない）', '2004-11-13 07:33:25+00', '2004-11-13 07:33:25+00');
INSERT INTO blogpost VALUES ('23278895-d881-4cce-a625-04cfede61055', 'TechEd  Yokohama 2008でしゃべります', 'TechEd  Yokohama 2008のシアターセッション枠に登壇することになりました。

「.NET to .NET マイグレーション ～ 移行計画立案と実践 ～」というタイトルで、会社の上司と2人でやります。

内容はT2-202の「.NET to .NET マイグレーション ～ .NET Framework 1.x から最新環境への移行のために ～ 」と関連しつつ、実践に基づいた話をすることになります。

……ただ、この時間帯は荒井さんの「.NET における軽量言語」をやってるんですよねー。Silverlight好きにはつらいところ。', '2008-08-12 15:12:23+00', '2008-08-12 15:12:23+00');
INSERT INTO blogpost VALUES ('b4512925-110f-4d9d-88c5-0a695197456c', 'Queen + Paul Rodgers (10/26)', 'さいたまスーパーアリーナに行ってきました。

本当は忙しかったのですが、わがままを言って定時にあがって直行しました。

・開演直前にIt''s A Beautiful Dayのリミックスが

・開演直前にエミネムの曲に合わせてブライアンのギターが

・Tie Your Mother Downから立ちっぱなし

・Love Of My Lifeで感涙

・Teo Torriatteが聞けた

・ブライアン・メイの（有名な）ソロが聞けた

・Radio Ga-Gaで全員ハンドクラップ

・ボヘのオペラ前まではフレディ（の映像）、オペラ後はポール

・I Was Born To Love Youは、まあ日本独自のおまけ

・The Show Must Go Onでまた感涙

・We Will Rock Youで会場が揺れる

・締めはやっぱりGod Save The Queen

ポールの曲は知らないまま行きました。ショウマンシップ溢れるかっこいいシンガーでした。', '2005-10-27 17:37:54+00', '2005-10-27 17:37:54+00');
INSERT INTO blogpost VALUES ('a236a4b3-ac7b-487f-b53a-6004a78867fd', 'デカメロン伝説', 'ドレミラーミレド　ラシドミードラソ

ドレミラーミレド　ラシドミードラソ

めばちこ！', '2002-02-14 14:59:59+00', '2002-02-14 14:59:59+00');
INSERT INTO blogpost VALUES ('ae4afc2b-e084-4f36-a23d-495998eccbdd', '10/31 ハロウィーン', '家族でTDLへ。

楽しかったのだが、岩下と飲みに行けず。

連絡しなくてごめんよう。TDLが先約だったんだけど、曜日が確定したのが金曜だったんだよう。

それはそれとして、TDLだ。

ハロウィンだったので、仮装している人が多い。

ディズニーキャラに仮装してくるとちょっとした特典があったらしい。

でもね。

ゴスロリなアリスご一行（アリスとか兎とか狂った帽子屋とかの衣装が黒い）とか

キングダムハーツのコスプレとか

そういうのは、何か違うと思うんだな……', '2004-11-01 12:01:00+00', '2004-11-01 12:01:00+00');
INSERT INTO blogpost VALUES ('67a301e2-0f29-4421-a87d-000e7da6255e', '1998/9/17の日記', '「ピンク・フラミンゴ」観てきた。凄かった！最低最悪のおげれつ映画なんだけど、最高にばかばかしくて、凄くカタルシスがあった。各界で評価が高いのもうなずける。でも、万人に薦められる映画では、決して無い。', '1998-09-17 14:59:59+00', '1998-09-17 14:59:59+00');
INSERT INTO blogpost VALUES ('842152e9-aa42-456d-b0df-26b0c10b6d05', 'ウサギ１', 'うちのウサギとは5年間の付き合いだった。

名前はチリ。

人に説明するときは「チリソースのチリだよ」とか、あるいは音楽を聴くような人には「レッチリのチリだよ」とか言っていたが、本当はパチスロからとった名前だった。「アステカ」という機種の絵柄「デカチリ」が由来。結局唐辛子なのは一緒だが。

なぜパチスロなのか。それはパチスロで勝ったイキオイでうちに連れて帰ったからだ。

その頃、友人のannieとrolioがウサギを飼い始め、俺にも「ウサギはいいよ！」と勧めていた。だけど俺は動物を飼うつもりはなかった。

そんなある日、2000年の1月2日、実家に帰らずに正月をだらだら過ごしていた俺とrolioは一緒にパチンコ屋に行った。だがその日はツイてないのか、お金がどんどん減っていった。「だめだ、今日は勝てる気がしない」と言う俺に「じゃあ賭けをしよう。もし勝ったらウサギを飼え。」とrolio。「ああいいよ。でもきっと負けるよ」と俺。その直後に俺は大当たりを3度引き当て、2万円近い現金を手にしたのだった。', '2005-02-16 16:18:52+00', '2005-02-16 16:18:52+00');
INSERT INTO blogpost VALUES ('af99abaa-a01a-4807-bf61-468d80074a28', 'We Will Rock You@新宿コマ 今年も', '今年も観にきました。

キャストは去年と同じくオーストラリアメンバーなのですが、
数人が入れ替わっていました。(キラークイーンとオズ)

他にも、台詞回しとか演出とかがすこーし変わっていたような。

しっかし、これ観るの通算で4回目になるんだな。', '2006-12-01 11:33:57+00', '2006-12-01 11:33:57+00');
INSERT INTO blogpost VALUES ('e101b380-8261-4b0d-94a4-6246cb5d3fba', 'Internet Explorer ではなく適切な Office プログラムで Office ドキュメントが開かれるように構成する方法', 'http://support.microsoft.com/default.aspx?scid=kb;ja;162059

Googleの検索結果がpptだったりdocだったりすることがある。そんなリンクをクリックすると、IEとかIEコンポーネント利用ブラウザとかの画面内にwordやexcelのファイルが開かれてしまう。操作感覚が変わってしまい非常にうっとうしいのでブラウザ上に表示させたくない。Acrobat Readerもそうだったんだけど、そっちの設定画面には「PDFをブラウザに表示」というチェックボックスがあるので、それをオフにすればよかった。でもOfficeにはそんな設定項目は無い。ActiveXを切る設定にするのは、Windows Updateとかが使えなくて嫌だし。

…とこのようにわざとだらだら書いたのは、同様の悩みを解決しようとしてサーチエンジンで検索する人のため。（なにより、未来の自分ならきっとまた検索するだろう。）検索用の適切なキーワードが思いつかなかったので、あえて冗長に書いています。', '2004-01-06 10:23:02+00', '2004-01-06 10:23:02+00');
INSERT INTO blogpost VALUES ('ddadc804-505c-4474-af27-a443ae22d042', 'いよいよか', '夜中に起きて病院へ。予定日より少し早めの入院。
昨日、検診を受けたばかりで、その時はこんなすぐに入院することになるとは思ってなかったが、それでも体重的には問題ないし、そんなに心配してない。
数日のうち、だろうな。妻がんばれ。愛してるぜ。', '2014-10-24 22:37:21+00', '2014-10-24 22:37:21+00');
INSERT INTO blogpost VALUES ('a9c01311-e02a-4876-aff4-3a8ec24e8fb5', '1998/10/3の日記', '津田くんから「さらば夏の光よ」という映画の話を聞く。ベルセルクの最終回を観終わってテレビをつけっぱなしにしてたら始まったそうだ。主演・郷ひろみ！とか、若い頃のヒロミGOがアフロな頭でチンピラ役を怪演！とか聞いてしまうと、いくらヒロインの秋吉久美子も良かった、と言われても、頭の中はダメダメ映画。勢いでツタヤに行くも、置いてなかった。不完全燃焼。いつか観てやる。 ', '1998-10-03 14:59:59+00', '1998-10-03 14:59:59+00');
INSERT INTO blogpost VALUES ('333eb06c-23fc-4fbe-88ed-15c9349e7c49', 'ウサギの死', '1/26深夜、飼っていたウサギが息を引き取りました。

まだうまく書けません。 

書けるようになったら挑戦してみます。', '2005-01-28 20:16:04+00', '2005-01-28 20:16:04+00');
INSERT INTO blogpost VALUES ('d28135dd-0840-4fcb-b0c8-c6fb65db1a86', '1998/8/8の日記', '鬼怒川＆日光へ研究室旅行。温泉良かった。徹マン負けた。江戸村のB級感が良かった。にゃんまげを生で見たけど飛びつかなかった。にゃんまげの携帯ストラップを売ってたけど買わなかった。最終的には風邪引いた。なんでだ。', '1998-08-08 14:59:59+00', '1998-08-08 14:59:59+00');
INSERT INTO blogpost VALUES ('1289ba4c-1ed9-406a-afe7-cc9b83f6c5b6', 'Martin Fowler氏、4月に来日', 'Martin Fowler''s Bliki in Japaneseを読むと、MSのイベントで来日するとのこと。

そういえば、MSからアーキテクチャ関係イベントのお誘いが来ていたけど、あれかなあ。だとしたら万難を排して参加しなければ…

その時はPatterns of Enterprise Application Architectureにサインしてもらおう。

追記(まとめて書き直し)：

まず、私がMSからお誘いを受けたイベントは、Fowlerたんとは無関係でした。

次に、4/20開催のリックテレコムのセミナーに出席するのは確定。ユニシス尾島も出席するので、ついていこう。ただし、Fowlerたんは午前中しかいない。午後は別の仕事が入っていることを確認(ソースは出せません。すみません)。

そして、4/21日にはMS主催のイベントに参加。', '2004-03-10 07:29:50+00', '2004-03-10 07:29:50+00');
INSERT INTO blogpost VALUES ('40038377-3975-498e-9b67-982edca3a7c9', 'ミスター ァァァァーァー ムーンラーイッ', 'Mono meeting 2007-06-27 Moonlight Specialが気になっている。が、今行っても口ポカーンで聞いてるだけになりそうで気が引けている。

DLRとは言わないまでも(これが一番楽しそうなんだけど)、WPFやXAMLについては仕込んでおかないとダメだなあ。', '2007-06-08 01:57:22+00', '2007-06-08 01:57:22+00');
INSERT INTO blogpost VALUES ('3a708bb6-e5a5-4f5c-8e3a-1a6f345850f6', 'J2EEのコードをC#に変換', 'Microsoft Java Language Conversion Assistant 3.0 beta

不勉強でよく知らなかったのだが、Javaライブラリの呼び出しも.NET共通ライブラリの呼び出しに変換されるそうだ。それはすごい。てっきりJ#.NET専用ライブラリを呼び出すだけだと思っていた。

そして、JLCA3.0では、J2EE 1.3とJDK 1.3に対応し、EJBやJAASやJCEやJMSやJNDIやRMIに対応しているらしい。

さすがにJAXはまだか。

もしJDBC周りがDataReaderあたりにマップされて動作するのであればすごいなあ。そのへんどうなんだろ？

', '2004-02-06 10:14:44+00', '2004-02-06 10:14:44+00');
INSERT INTO blogpost VALUES ('544d4bd6-8cf6-46e3-add9-c42ea08100f8', 'ReSharperの個人ライセンスが$99', 'JetBrains社が2/1までの特別キャンペーンをやっています。

よし、今こそゲットだ。', '2007-01-19 07:18:22+00', '2007-01-19 07:18:22+00');
INSERT INTO blogpost VALUES ('d0172a5d-af1e-41eb-a6fd-7834ea2e7922', 'transit', 'changi airport, singapore.

there is no global ime installed and i don''t have a permission to install it. but it''s okay.

changi is interesting. free movie, free internet service, free xbox game, pool, fitness gym, and so on...', '2007-05-24 10:12:01+00', '2007-05-24 10:12:01+00');
INSERT INTO blogpost VALUES ('eedc75a3-fafc-4f7d-a9b4-9bdb8026a335', '1998/5/7の日記', 'ウルトラクイズ復活。留さん頑張れ。 ', '1998-05-07 14:59:59+00', '1998-05-07 14:59:59+00');
INSERT INTO blogpost VALUES ('8204567f-4b34-438d-87c8-15d4c7bf7227', 'P&P App Arch Guide 2.0 (Beta 1)', '"patterns & practices Application Architecture Guide - v2.0"のベータ１が出てます。

旧版について、@ITに記事を書いたのもだいぶ前だなあ。', '2008-11-05 05:06:27+00', '2008-11-05 05:06:27+00');
INSERT INTO blogpost VALUES ('a4a04dfd-7cd5-4ce8-b8d7-b8fb82ed2918', 'レモンガス', '「レモンガス ちっちきちっち　YO!」のガキ、すごい顔するなあ。腹立つなあ。かわいいなあ。 ', '2007-06-09 11:45:25+00', '2007-06-09 11:45:25+00');
INSERT INTO blogpost VALUES ('d832612a-6d17-4c6c-be85-aabc286e899e', 'ギター弾きに貸す部屋はねえ', 'リーマンロッカー練習中。

……焦る。', '2000-06-30 14:59:59+00', '2000-06-30 14:59:59+00');
INSERT INTO blogpost VALUES ('e6875db9-c13c-43d6-80e7-8615a57ab201', 'LTのネタどうしようかなあ……', 'こんどわんくま勉強会のLT大会に出ることになっているのですが、まだネタが決まらなくて困っている。

「解題：私がJavaからC#に乗り換えた10の理由」でもやろうかな。尾島さんはベトナムに行ってていないし、勝手にやっても問題なかろう。

でも、いまさらかなあ。いまさらだよね。', '2008-10-31 15:36:29+00', '2008-10-31 15:36:29+00');
INSERT INTO blogpost VALUES ('a029d240-d43a-444e-acc5-3d1017ae6283', 'WhidbeyのモデリングツールWhitehorse', 'C|NET Japanに「Whitehorse」は、Windowsソフトウェア開発に革命を起こすか?という記事が載っています。

MSの製品なので「使える」ものになるとは思います。

開発スタイルが変わるかどうか、注目しています。

', '2004-02-28 19:12:21+00', '2004-02-28 19:12:21+00');
INSERT INTO blogpost VALUES ('f69f6366-0825-43a5-9d71-7d9501350a7f', 'リッチクライアントの一例', '・損保ジャパンDIY生命保険 

・フコク生命保険選びフィット 

はFlashでできている。

道具にXXXを使ったからこういうUIができた、という話ではないのだ。目的（資料を請求してもらう数を増やしたい）達成のためにはどういうUIであるべきか（入力させる量を減らす、おすすめプランの提示までにかかる時間を短縮する、利用者が関心を持った情報のみ詳しく提供する）をしっかり検討しないといけなかったはず。

こういう検討って業務アプリケーションでは充分になされてない印象がある。あるんだけども、そういう検討の結果リッチなUIが必要だという結論が出てくるような業務アプリケーションってなんだろう。

データ入力系は除く。あれはキーボードによる高速操作が要求されているのであって、(Webでは困難であったとしても)それをリッチなUIと呼ぶのかは疑問だ。
', '2005-03-17 07:06:26+00', '2005-03-17 07:06:26+00');
INSERT INTO blogpost VALUES ('d6dae16c-aba8-4322-87dd-7bc3fc743e7f', '1998/6/29の日記', '安田の家で「暴れん坊天狗」をプレイ。環境破壊に怒った天狗が山を降りて来て文明社会に復讐する、というストーリーのシューティングゲーム。ビルとかをがんがん撃ち壊す。昔のファミコンゲームとは言え、激しすぎ。激ムズ。ふたたび焼き鳥を作ってもらい食べる。やっぱり美味しい。', '1998-06-29 14:59:59+00', '1998-06-29 14:59:59+00');
INSERT INTO blogpost VALUES ('1f55ff23-81dc-4405-a80e-a5b109262bb1', '1998/7/6の日記', '最近インターネット日記の意義が分からなくなって来た。当初は自分の考えた事を書きまくってストレス解消…のつもりだったが、結局、親だったりバイト先の社員さんだったり友人達だったりがみんなここを読んでいる(可能性が高い)状況では、人には言えない話なんか書く訳にはいかない。あたり触りの無い事だけを書くしかない。するとストレス解消どころか逆にフラストレーションが溜ってきているようだ。やっぱり日記って公開するものじゃあ無い。毒にも薬にもならないような内容の日記を書いても読んでもらえるのは、有名人だけではないだろうか…', '1998-07-06 14:59:59+00', '1998-07-06 14:59:59+00');
INSERT INTO blogpost VALUES ('4d435451-9225-40da-9b26-cd164a4b6e9d', '大阪人', '「いとし・こいし」とか

「カウス・ボタン」とか

「いくよ・くるよ」とかと同じように

つい「マクド・ナルド」と切っちゃうのが原因だと思う。

しょうがないよね、お笑いにマインドコントロールされてんだから。', '2001-06-10 14:59:59+00', '2001-06-10 14:59:59+00');
INSERT INTO blogpost VALUES ('5b770294-9b85-4701-a01d-7bab66b86143', '今日のなんでMovableTypeやねん', 'はじめてMovable Typeを設置したときのことは記録に残しておこう。

WayBackMachineに残るログ。tDiary風味にしてみたのは2002年11月。', '2002-09-06 13:30:08+00', '2002-09-06 13:30:08+00');
INSERT INTO blogpost VALUES ('87c2c5ab-7cf9-4ae5-a38f-74113351fb5a', '認めたくないものだな。自分自身の若さ故の過ちというものを…', '「神聖モテモテ王国」についての話が盛り上がった翌日、Book Offにて１～３巻をゲット。

ゲームセンターでドラム叩き。満足して別のゲームを見て回る。と、自分が手ぶらな事に気づく。

ドラムマニアのあたりを見回す。…ない。

「あのー、黄色い袋に入ったマンガ、落ちてませんでしたか?」

（奥の部屋を調べた後戻ってきて）「題名は何かお分かりになりますか?」

「し…神聖モテモテ王国、ですけど…」

「え？何ですか？」

「神聖モテモテ王国ですっ」', '2000-11-09 14:59:59+00', '2000-11-09 14:59:59+00');
INSERT INTO blogpost VALUES ('47cbf4bb-6a36-4f27-aa53-cda60f91bd21', 'MacWorld Expo', 'ねむいけどテキストライブ(http://www.macrumorslive.com/)みてる

4つのお知らせ。

タイムカプセル、iPhone、iTunesムービーレンタル、Apple TV?

One more thingは？

あ、4番目がMacBook Air。ってことはATVは3番目に含まれるんだな

Sony TZが3ポンド(1.36kg)で20ミリ～30ミリ。MBAは4ミリ～19ミリ

2GBのメモリ、80GBのHDD、光学ドライブなし、マルチタッチトラックパッド。おねだん1799USD(229,800円)。SSDに変えると3098USD!

One more thingはありませんでした。オヤスミ。', '2008-01-15 17:30:05+00', '2008-01-15 17:30:05+00');
INSERT INTO blogpost VALUES ('0feb1eb4-68f7-4e6c-bd08-5e0ef0b380df', '十字架', '仲良き事は美しき哉。

でも難しいことです。', '2000-07-25 14:59:59+00', '2000-07-25 14:59:59+00');
INSERT INTO blogpost VALUES ('26ddc21f-e1a8-4065-9006-f4dfb8190d60', '.NET Expert #01', 'TechED 2005に行けず、ふてています。

技術評論社から.NET Expertという雑誌が出ました。

私は執筆してませんが、同僚たちがVS2005について記事を書いています。

技術評論社からは、見本誌をたくさんいただきました。1つの記事を7人で書いたからでしょう。かえって申し訳ありません……
', '2005-08-05 09:40:54+00', '2005-08-05 09:40:54+00');
INSERT INTO blogpost VALUES ('11863756-5309-4336-90b5-8bdf36fc8de4', 'mixiの場合', '連投した日の頭のほうの記事はマイミクシィからスルーされやすい。しかも外部blogの場合は一日1回ぐらいしか更新チェックしてくれないから尚更。

mixi経由でこのブログにアクセスして、その流れでこの記事にたどり着いた熱心な人(感謝)がいたらコメントよろしく。帰国したらシンガポール土産あげます。RSSリーダとかアンテナとかを経由した人は除く。', '2007-06-03 19:45:05+00', '2007-06-03 19:45:05+00');
INSERT INTO blogpost VALUES ('1f3fab3d-2dad-4e47-91ed-4fcc7a1acdb5', 'Microsoft MVP受賞しました', 'カテゴリはVisual C#です。

MVPプロファイルはこちら。

初受賞となります。どうぞよろしくおねがいします。', '2008-07-02 02:59:39+00', '2008-07-02 02:59:39+00');
INSERT INTO blogpost VALUES ('a5c9e215-f303-419c-a493-e29034ab3aee', '柳原可奈子', 'Tech Ed 2007の書籍コーナーのおねえちゃんの呼び声が柳原可奈子にそっくりだった。

「いらっしゃいませーどうぞーご覧くださーい」

しまいには「よかったら全然立ち読みしちゃってもいいですよー」とか「それ可愛くないですか？可愛いですよね？」とか「やっぱり翻訳の質とか気になっちゃう感じ？」とか言いだしそうだった。', '2007-08-26 05:11:50+00', '2007-08-26 05:11:50+00');
INSERT INTO blogpost VALUES ('b4a4cc91-59b9-4a0d-85b6-35f0c44dfb12', '康隆の結婚式', '早稲田教会にて。

時間を間違え遅刻するという大失態。

その後信愛学舎でパーティ。

スピーチは、もっと褒めればよかったね。でもうけは取れたからよし。

結婚自体は、ごくふつうに「良かったな。」と思う。

でもそれ以上に、友人たちに囲まれて、みんなに祝ってもらって、幸せそうにしている二人が、我が事のように嬉しい。

いい式でした。', '2005-05-23 06:50:38+00', '2005-05-23 06:50:38+00');
INSERT INTO blogpost VALUES ('730a5ad5-2442-44d2-98da-3f993fa2eab7', 'Web Matrix Japanese Edition', 'いろんなところで話題に上っていますが、ついに出ましたね。

ASP.NET Web Matrix Project 日本語版

雑誌記事を書いたり、サンプルを載せたりする場合はこれを意識すべきでしょう。', '2004-02-25 03:25:40+00', '2004-02-25 03:25:40+00');
INSERT INTO blogpost VALUES ('5f342a4f-38dc-461f-b287-0e68be5deecd', '明日はVSUG設立記念セミナー', 'イベントの詳細はこちら

参加予定者限定で、おぎわらさんとはぎわらさんの発表資料が公開されました。

興味を持って読みました。

はぎわらさんには質問を用意して行くべきだろうか。

でも本当は、お二方の後にスケジュールされている、各フォーラムリーダーによるLightning Talksが楽しみなのです。

フォーラム上では見えにくい、皆さんの素顔やキャラクターを見てきます。

きっと準備は大変だと思いますけど。５分程度とはいえ。
', '2005-12-02 05:08:17+00', '2005-12-02 05:08:17+00');
INSERT INTO blogpost VALUES ('b8968abb-1c7b-406e-bea6-a87c1fa6fdde', 'DOAとUMLを“いいとこ取り”', 'IT Pro ITレポート（動向／解説）より

UMLは設計手法ではないと思うけど、それはそれとして。

.NETではO-RマッピングよりDataSetを使ったDOA的な設計の方が相性がいいと思っている。

今回はJavaだけど、他の人たちの同じようなアイディアも知っておかないと。

', '2004-02-10 08:04:19+00', '2004-02-10 08:04:19+00');
INSERT INTO blogpost VALUES ('85035f7c-1443-4ac8-ae4d-3691bbd52695', 'Money', 'P of EAAで紹介されているTable ModuleパターンをC#で実装……する前段階（というか、遊び）として、Moneyパターンを実装してみる。

遊びなので、試しに構造体としてMoneyを実装してみる。ポリモーフィズムが使えないので、すべての通貨で同一実装を利用することになる。

いろいろ試した後にそれなりのものができたが、10進法を前提にしたコードになってしまっていた。10進法以外を利用する通貨では計算が合わなくなる。ウウウ。

ところで、現在流通している通貨で10進法以外を採用しているものって、どんなものがあるでしょうね？', '2004-12-09 17:55:46+00', '2004-12-09 17:55:46+00');
INSERT INTO blogpost VALUES ('ac9e2f2f-2c08-4423-9499-c0992e00acab', '1998/7/14の日記', 'ドラえもんの最終回がメールで飛び回っている。はっきり言って不幸の手紙状態(チェーンメール、といいます)なので、もう私には送るな。って言うか誰にも送るな！', '1998-07-14 14:59:59+00', '1998-07-14 14:59:59+00');
INSERT INTO blogpost VALUES ('22627c87-d8b5-44e2-920c-c557342e7c31', 'Wiz', 'murmur - chant - pray - invoke!

Matarillo turned to ashes.', '2001-12-08 14:59:59+00', '2001-12-08 14:59:59+00');
INSERT INTO blogpost VALUES ('e2dca40f-a3bb-43a2-ba4e-74d4c5b5b41b', 'Application Architecture for .NET', 'Application Architecture for .NET

.NET Frameworkをプラットフォームにした分散アプリケーションを構築するときのアーキテクチャガイド。

.NETにおけるJ2EE Blueprintsになるだろうドキュメント…だと思うんだけど、知名度が低いように感じられるのはなぜ？

日本語に翻訳されていないから？

…たぶん、エンタープライズ領域で .NET Frameworkがまだまだ広まってないからなんだろうけど。', '2003-06-26 09:59:08+00', '2003-06-26 09:59:08+00');
INSERT INTO blogpost VALUES ('cd7cb62c-5027-4e48-a5ba-b85f8051bfe4', 'ゆうこりんと飯島愛のミッシング・リンク', '今なら十中八九小倉優子がこなすであろう役を昔は飯島愛がやっていた事実。

まんがの森、きてみろりん。

えーと、仕事してないときはこういうことばっかり考えています。

同じことを考えてる人を発見しました。', '2005-11-14 21:42:13+00', '2005-11-14 21:42:13+00');
INSERT INTO blogpost VALUES ('a6460278-073e-47bf-8e4e-0d561fa2eae2', 'MSがソフトウェア製品にOSSを組み込めないのはなぜ？', 'ときどきの雑記帖で知った、Coding Horrorの"Why Can''t Microsoft Ship Open Source Software?"という記事が面白い。

MSのファンもアンチも一読を。コメントも含めて。

(MS無関心層は……そもそもここを読んでいないか。)', '2008-07-04 21:41:41+00', '2008-07-04 21:41:41+00');
INSERT INTO blogpost VALUES ('88f7c813-965e-4850-a39f-c7a5d1d0c4f0', 'TcpClientのメモ', '.NET Frameworkに用意されている各種ネットワークアクセスクラス(WebClient, WebRequest/WebResponse, SmtpClient)ではなく、あえて低レベルのTcpClientを使うときもあります。そんなときのための注意点を。

ストリームの終わりをどのように判断するか、これは悩ましいところですが、NetworkStream.DataAvailableを使うのはやめておいたほうがいいです。送信元がデータを送るとき、いつでも全部まとめて送信するわけではないからです。たとえば、ある瞬間にはDataAvailableがfalseになっていても、1秒後にはtrueになったりします。「じゃあ、NetworkStream.DataAvailableがfalseならしばらく待ってみて、それでもfalseだったら読み取り終了にすればいいじゃないか」というのは筋が悪いです。いったい何秒まてば十分なのかは誰にも分からないですし、それに無駄な待ちが必ず発生することになりますしね。

結局のところ、規定の長さに達するまでStream.Readするか、またはデータの区切り(CrLfなど)が届くまでStream.ReadByteを繰り返すか、そのどちらかを選択するのがいいでしょう。もちろん、どちらを選ぶかはプロトコル次第ということになります。そのように実装すると、データの終わりを受け取るまではブロックすることになります。ですので、適切なタイムアウトは必須でしょう。

データの区切りが(CrLfなど)決まっている場合はStream.ReadByteを繰り返せと書きましたが、反論が2つ考えられます。1つ目は「区切りがCrLfなら、StreamReaderを使ってReadLineした方が簡単」という意見と、もうひとつは「1バイトずつStream.ReadByteするのは遅い」という意見です。

最初の意見ですが、もし送られてくるデータが全て文字列で、しかも最初から最後までエンコーディングが固定されているのなら、そのエンコーディングに対応したStreamReaderを使うのもいいでしょう。ですが、そうでないなら、つまりエンコーディングはデータを受け取るまで分からないとか、あるいは途中からは生のバイト列が必要になるとか、そういう場合はStreamReaderは向いていません。StreamReaderはストリームの先読みをして、内部でバッファリングします。ですので、「次の行からはエンコーディングの異なるStreamReaderを使う」とか「次の行からはバイト列」といったときに、ストリームの位置は次の行の先頭よりも先に進んでいます。要するに、StreamReaderを使った場合は、もう元のStreamは使えないと考えるべきなのです。(天邪鬼な人はISO-8859-1エンコーディングを持ち出すかもしれませんが、その議論はここではしません。「できるけど、ムダが多い」とだけ述べておきます。)

もうひとつの意見、つまりReadByteは遅いという意見ですが、それは生のNetworkStreamを1バイトずつ読み取るから非効率なので、そういう時はBufferedStreamでラップしてやればいいのです。もちろん、BufferedStreamは内部でバッファリングしますから、BufferedStreamを使った場合は、もうもとのStreamは使えないことに注意しなければなりませんが、大きな問題にはならないでしょう。', '2006-07-12 01:57:50+00', '2006-07-12 01:57:50+00');
INSERT INTO blogpost VALUES ('da8507d4-8de0-4f8d-8b36-a9aaa3cfa794', 'スマブラXが欲しい', 'Wii「大乱闘スマッシュブラザーズX」の音楽スタッフが異常すぎる

ギャッ。オタク心をくすぐる……

Wii持ってる友人夫婦にプレゼントしようかな(そして自分がプレイしようかな)', '2007-05-23 01:36:08+00', '2007-05-23 01:36:08+00');
INSERT INTO blogpost VALUES ('f8f01b59-b417-49f5-87c0-d8a54f13f147', 'ウサギ3', 'そんな経緯というかひらめきでウサギを選び連れて帰った。さて、名前はどうしよう。

パチスロ台から名前をとろうか。「アステカ」（機種名）とか「デカチリ」（大きい唐辛子：特徴的な当たり絵柄）とか。「ケツアルコアトル」はアステカの翼蛇神の名前だが、大げさなのでボツ。

「カブキ」、あるいは歌舞伎役者の名前はどうだ。まあまあかな。「勘九郎」とか。

ん？こいつオスだっけ？

rolioに見てもらった。「うーん、よくわからないけど、メスっぽい。」
ここで方向転換。しばらく悩んで、「ミューズ」とした。ギリシャ神話における音楽の女神たちのことであり、薬用石鹸を意識したわけではない。

しばらくは「ミューズ」と呼んでいたのだが、その後重要なことがわかった。ウサギの性別は生後3ヶ月程度たたないと判別が困難らしい。（タマが体内に隠れているため）

後日あらためて確認すると「あ……ある……」

「ミューズ」は撤回。結局、パチスロ台に絡めて「チリ」とした。しかし、人に由来を説明するのが面倒だ。「名前はチリ。デカチリのチリ。デカチリっていうのは唐辛子なんだけど、パチスロ台『アステカ』の当たり絵柄でね……」うへ。なので、"Red Hot Chili Peppers"からとった、ということにした。「名前はチリ。レッチリのチリ。」レッチリ知っている人ならこれで通る。', '2005-07-11 13:10:01+00', '2005-07-11 13:10:01+00');
INSERT INTO blogpost VALUES ('d812829c-d622-467e-8776-f83ea056e213', '学習院大 田崎さんの、物理に役立つ数学の教科書', '学習院大の田崎さんが、「数学：物理を学び楽しむために」というタイトルで数学の教科書のPDFを公開しています。

http://www.gakushuin.ac.jp/~881791/mathbook/

前書きを読んだだけでも、いい教科書だろうと思われる。今度の週末のお供にしようかな。', '2005-10-06 03:26:33+00', '2005-10-06 03:26:33+00');
INSERT INTO blogpost VALUES ('2ddae22f-8381-46e7-a3f3-32b6ad00eb27', '1998/6/15の日記', 'アシモフの「ファウンデーション」「ファウンデーション対帝国」「第2ファウンデーション」を続けて読む。素晴らしく面白かった。基本的には、人々が知恵と力を発揮させて危機を乗り越えていく話。「第2～」ではミステリ仕立てになっていて、読者は謎の答えを推理しながら読んでいく事になる。この3冊は短篇～中篇を集めた物であり、各章で完結してはいるのだが、やはり最初から(ファウンデーションの歴史に沿って)読むべきだろう。さーて次はアシモフのロボットシリーズを読んでからファウンデーションの続編に移ろうっと。', '1998-06-15 14:59:59+00', '1998-06-15 14:59:59+00');
INSERT INTO blogpost VALUES ('81d3f3f5-6377-4b06-a5e5-12d56ff1159e', 'Office 2003をWiki Clientに Part 1', 'WebMatrix Hostingを借りて、自作のWikiを設置しました。

http://inomata.japan.webmatrixhosting.net/

このWikiは、XML Webサービスに対応しているのがポイントです。

インタフェースは、JSPWikiのWiki RPC Interface 2を勝手にSOAP化したものです。

http://www.hyuki.com/yukiwiki/wiki.cgi?WikiRPC', '2004-07-31 02:55:59+00', '2004-07-31 02:55:59+00');
INSERT INTO blogpost VALUES ('48250c63-2826-4d6e-93cd-10dc9d8847dd', '変な英語Tシャツ', '"Welcome to the road of  hell!"から始まる数センテンスの英語が書かれたTシャツを着ている人を月島で見た。

これって「ここが地獄の一丁目だ！」って意味だと思えばいいのかなｗｗ', '2007-09-28 01:18:28+00', '2007-09-28 01:18:28+00');
INSERT INTO blogpost VALUES ('3214771a-da28-40cb-800c-3aaee35f8084', '赤羽のうまいパン屋', 'ウィンザーホテル洞爺にあるオテル・ド・カイザーの責任者だった大室雄司さんが、なぜか、赤羽ダイエーの店内に自分の店を出した。

まあ、メゾン・カイザーに行けばいいじゃないかという話なんだが、
家の近くで並んだりせずにおいしいパンが買えるのはうれしい。

さっき買って食べた。うまかった。これからはちょくちょく利用しよう。', '2007-10-08 09:40:11+00', '2007-10-08 09:40:11+00');
INSERT INTO blogpost VALUES ('dfbc25cd-703c-429c-9ee7-8af61d340657', '高尾山ハイキング', '「隊長、眠いです！」電車の中で休んでおけ！

「隊長、雨が降ってきました！」駅前で傘を買うんだ！

「隊長、どのルートで登山するんですか？」ケーブルカーを使おう！

「隊長、モヤが出てきました！」固まって歩け！はぐれるな！

「隊長、写真とってください！」よし、みんな真ん中に寄れ！

「隊長、ジュース買ってきて！」烏龍茶でいいか？

「隊長、荷物持って！」重いな、これ！

「隊長、何かちょうだい」キャラメルしかないけど！

「隊長、今すぐラーメン食べたい！」「隊長、今日のバイト代わって！」「隊長、後ろ！後ろ！」', '2001-11-05 14:59:59+00', '2001-11-05 14:59:59+00');
INSERT INTO blogpost VALUES ('c4c4c74c-d397-40fe-95d6-7bd826448479', 'あなたのエディタで.NET開発', 'ハッカー気質の人にしてみれば自分の使い慣れたエディタで開発したいわけで、Visual Studioみたいに汎用性もないくせにやたらとデカくて重いIDEを強制させられるのは悪夢以外の何者でもない。

……と、いうことなのではないか。

いや、何が言いたいかというと、.NETのつまみ食いをしようと思った時にVSが障壁になってしまって、結果として敬遠されている面もあるのかなと。

もちろん、Visual Studioは使わなくたって開発できる。MSの技術カンファレンスやWebCastを見てても分かるが、MSの中の人でもたまにEmacsを使ってデモをしている人もいる。

# ITゼネコンな仕事でチーム開発をしている立場としては、Visual Studio縛りというのは（しょぼい独自フレームワークとか独自ツールとかを押し付けることを考えれば）かなりマシな方だと思うのだけど、それはまた別の話。

ってことで、たとえばVSを使わず、もっと言うとmsbulldも使わず、素のcscを使ったり、あえてmakeとかantとかから呼び出したりするサンプルとか、たとえば「連載：好きなエディタでSilverlight」みたいな企画はどうか。

MSも動き出しているんだね。', '2008-04-28 20:51:55+00', '2008-04-28 20:51:55+00');
INSERT INTO blogpost VALUES ('cf8881e8-38ac-4519-8d92-759256e887fa', 'Windowsな生活', 'msn spacesで始まっていた。

http://spaces.msn.com/members/windows/', '2004-09-03 10:01:36+00', '2004-09-03 10:01:36+00');
INSERT INTO blogpost VALUES ('de9b224d-3273-4c1a-ba3e-87842f22470a', 'MSDN .NET Architecture Center', 'リニューアルされた模様。(TheServerSide.net経由)

', '2004-02-18 09:33:02+00', '2004-02-18 09:33:02+00');
INSERT INTO blogpost VALUES ('113b8f76-ac81-47ae-94b1-ed50baac25b2', 'ASP.NET便利コンポーネント', '(TSS.NET経由)

円グラフや棒グラフなどのチャート: http://www.dotnetcharting.com/

スライダー、テキストボックス、カレンダー: http://www.richercomponents.com/

フリーのチャート: http://www.carlosag.net/Tools/WebChart/', '2004-12-12 07:36:22+00', '2004-12-12 07:36:22+00');
INSERT INTO blogpost VALUES ('c44d4680-11bf-4921-8254-b3a3fc1811f8', 'レイトショーでインディジョーンズ観たよ', 'ハリウッド的な面白さ。やっぱりすげえ。

ていうかケイト！ケイト・ブランシェットはもう怖い役柄しかオファーされないんじゃないのか。それでいいのかケイト。たまにはラブコメとかやったほうがいいんじゃないのかケイト。

そして、学長役の人は「ホット・ファズ」の警察署長だったのか。妻は気づいたが俺は気づかなかった。

(あとで詳細書くかも)', '2008-07-19 17:07:51+00', '2008-07-19 17:07:51+00');
INSERT INTO blogpost VALUES ('e62ba3c0-dde6-4150-bb8c-e77589c994e2', '椎名林檎のマキシ「本能」の発売迫る！', 'ところで、「臨界ウラニウム」って書くと、どこか林檎っぽい。', '1999-10-21 14:59:59+00', '1999-10-21 14:59:59+00');
INSERT INTO blogpost VALUES ('e5295a36-538a-481e-84d4-3c55faeaa117', 'Visual Studio Tools For Officeのトラブルシュート', 'Office 2003およびVisual Studio Tools For Officeをインストール。

VS.NET 2003を起動して新規プロジェクトを追加しようとすると、「Microsoft Office System Projects」が増えている。よしよし、順調だ。

Visual C# プロジェクトの「Excel ワークブック」を選択。するとウィザードが起動してプロジェクトを作成する。

作成されたプロジェクトにはThisWorkbook.csというソースコードが自動生成されている。ThisWorkbook.csではOfficeCodeBehindという名前のクラスが定義されている。

それはいいのだが、なぜかプロジェクトにMicrosoft.Office.Coreへの参照だけが追加されていない。ここでハマった、

Webでいろいろ探していると、Office 2003を修復すると治るとの情報が。さっそく試す。おお、たしかに治った。', '2004-07-20 10:53:16+00', '2004-07-20 10:53:16+00');
INSERT INTO blogpost VALUES ('363fa919-6c4e-481a-8b37-f43732bb2f68', 'Web+DB Press 見本誌届く', 'Web+DB PressのVol.19に記事を書きました。

正規表現に関する特集記事の、.NETのところを担当しました。

「.NETのところ」と書いたのは、その他にPerl, Java, PHPがあるからで、そこはすべて小山浩之さんが書いています。しかも.NETまで含めた比較表まで。さすがです。

それ以外でも今号は面白かった。

', '2004-02-21 01:37:07+00', '2004-02-21 01:37:07+00');
INSERT INTO blogpost VALUES ('4c6996dd-0ae3-482d-9385-b38b294b59a1', 'Silverlight2でClient-side database storage(2)', '前記事の続き。

まずはSQLの実行テスト。

うーん、"."以外だとこけるな。

WHATWG HTML5の仕様に沿ったJSのライブラリとしてまとめるのにはまだたどり着かない。

(追記1)あ、こけてるのは俺が書いたダミー実装クラスじゃん。(NotImplementedException投げてる。)お恥ずかし。本実装しなきゃ。

(追記2)よし、これで直ったかな？

(追記3)ソースコードはここ。', '2008-05-20 09:33:54+00', '2008-05-20 09:33:54+00');
INSERT INTO blogpost VALUES ('e521f0a9-15c4-4c52-876e-6c6eb9a2f5a7', '3Dなら', 'これからのデスクトップ環境が3Dになっていくのであれば、
もうマウスなんてかったるい物は使いたくないです。

すでに言われていることだとは思うんだけど、データグローブでいいじゃないか。

2次元だったカーソル操作が3次元になる。オブジェクトの3次元的ドラッグもできる。ファイルを投げ捨ててゴミ箱に入れてみたりね。

それと、マウスジェスチャーの替わりにハンドジェスチャー。

空中で、{手話, マジック, 太極拳} みたいな動きをすると、ファイルを開いたりアプリケーションを起動したりするわけ。

きっと楽しいと思うけれどなあ。', '2006-11-22 06:24:55+00', '2006-11-22 06:24:55+00');
INSERT INTO blogpost VALUES ('c1239f57-6518-47b0-8030-29418ba7048e', '雙六エクスタシー', '念願の椎名林檎ライブ＠武道館に行ってきました。思いのほか近くで見れた。

ツアーバンド「東京事変」（ヒイズミマサユ機、椎名林檎、畑利樹、亀田誠治、平間幹夫）もよかった。「正しい街」には涙腺が緩んだ。林檎のほくろがとれたのには驚いた。

アリーナ席で狂ったように体を動かしていた２人組以外、客席は総じて大人しく、「椎名林檎」の最期をじっくりかみ締めている印象だった。
', '2003-09-29 10:03:26+00', '2003-09-29 10:03:26+00');
INSERT INTO blogpost VALUES ('e2d1d6fb-c0f6-4403-8375-46911b9dcc1c', '寝返り', '娘が咳き込んでたので小児科へ。

そしたら、咳やたんより心音に雑音があるのが気になると言われ、別の病院を紹介されることに。後日検査。何もなければいいのだが。

診察後、そのまま妻の実家へ。

ここ数日は娘の機嫌が悪かったのだが、どうやらオムツかぶれではないか？とのことで、しばらくはおしりふきは控えよう(シャワーを活用しよう)と話し合う。

眠気が限界に近いので妻と娘をお願いして、自宅に戻る最中、どうやら初寝返りを目撃できた模様。', '2015-05-03 05:05:43+00', '2015-05-03 05:05:43+00');
